{
  "athkar": [
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_01.mp3",
      "period": "Morning",
      "order": 0,
      "content_ar": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ\n الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ۖ وَلَا يَؤُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
      "read_times": 1,
      "content_en": "A'uzu billahi min ashaitanir rajim\n\"Allahu la ilaha illa Huwa, Al-Haiyul-Qaiyum La ta'khudhuhu sinatun wa la nawm, lahu ma fis-samawati wa ma fil-'ard Man dhal-ladhi yashfa'u 'indahu illa bi-idhnihi Ya'lamu ma baina aidihim wa ma khalfahum, wa la yuhituna bi shai'im-min 'ilmihi illa bima sha'a Wasi'a kursiyuhus-samawati wal ard, wa la ya'uduhu hifdhuhuma Wa Huwal 'Aliyul-Adheem\"",
      "content_id": "A'udzubillahis samii'il 'aliim minasy syaithaanirrajiim. \"Allahu laa ilaaha illa huwalhayyul qayyuum laa ta khudzuhuu sinatuwwalaa nawum lahuu maa fiissamaa wati wa maa fil ardhi man dzalladzii yasyfa'u 'indahuu illa bi idznihii ya'lamu maa baina aydiihim wa maa khalfahum wa laa yuhiithuna bisyaiin min 'ilmihii illaa bimaa syaa wa si'a kursiyyuhus samaa waati wal ardhi wa laa yauduhuu hifdzuhumaa wa huwal 'aliyyul 'adziim.\"",
      "desc": "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح",
      "title": "١-٢٣",
      "duration": 80000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_02.mp3",
      "period": "Morning",
      "order": 1,
      "content_ar": "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ \nقُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ.\n بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ\n قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِنْ شَرِّ مَا خَلَقَ، وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ.\n بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ \nقُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَٰهِ النَّاسِ، مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ، مِنَ الْجِنَّةِ وَالنَّاسِ.",
      "read_times": 3,
      "content_en": "Bismillah, ar-Rahman, ar-Rahim\n\"Qul huwa Allahu ahad ,Allahu assamad , Lam yalid walam yoolad , Walam yakun lahu kufuwan ahad \"\nBismillah, ar-Rahman, ar-Rahim\n\"Qul aAAoothu birabbi alfalaq ,Min sharri ma khalaq , Wamin sharri ghasiqin ithawaqab, Wamin sharri annaffathatifee alAAuqad ,Wamin sharri hasidin itha hasad\"\nBismillah, ar-Rahman, ar-Rahim\n \"Qul aAAoothu birabbi annas , Maliki annas , Ilahi annas , Min sharri alwaswasi alkhannas , Allathee yuwaswisu fee sudoori annas , Mina aljinnati wannas\"",
      "content_id": "Bismillahirrahmaanirrahiim. \"Qul huwallahu ahad. Allahush shamad. Lam yalid walam yuulad.Walam yakul lahuu kuffuwan ahad.\" Bismillahirrahmaanirrahiim. \"Qul a'udzu birabbil falaq.Min syarrimaa khalaq.Wa min syarri ghaasiqin idzaa wa qab.Wa min syarrinnaffaats tsaati fil 'uqad.Wa min syarri haasidin idza hasad.\" Bismillahirrahmaanirrahiim. \"Qul a'udzu birrabinnaasi. Malikinnaasi. Ilaahinnaasi. Min syarril waswaasil khannaas. Al ladzii yuwas wisu fii shuduurinnaas. Minnal jinnati wannaas.\"",
      "desc": "من قالها حين يصبح وحين يمسى كفته من كل شىء",
      "title": "٢-٢٣",
      "duration": 286000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_03.mp3",
      "period": "Morning",
      "order": 2,
      "content_ar": "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
      "read_times": 1,
      "content_en": "Asbahna wa-Asbaha-mulku lillah walhamdu lillah la ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, rabbi as-aluka khayra ma fee hatha Alyoom, wakhayra ma baAAdah, wa-aAAoothu bika min sharri hatha Alyoom, washarri ma baAAdah, rabbi aAAoothu bika minal-kasal, wasoo-il kibar, rabbi aAAoothu bika min AAathabin fin-nar, waAAathabin fil-qabr.",
      "content_id": "Ashbahnaa wa ashbahal mulku lillahi wal hamdulillah, laa ilaaha illallaah wahdahu laa syarika lah lahul mulku wa lahul hamdu, wa huwa 'ala kulli syai-in qodiir, rabbi as aluka khoiro maa fii hadzal yaumi wa khoiro maa ba'dah, wa a‘uudzubika min syarri maa fii haadzal yaum wa syarri maa ba'dah, rabbi a'uudzubika minal kasali wa suu'il kibar, rabbi a'uudzubika min 'adzaabin finnaari wa 'adzaabin fil qobr.",
      "desc": "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
      "title": "٣-٢٣",
      "duration": 59000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_04.mp3",
      "period": "Morning",
      "order": 3,
      "content_ar": "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور",
      "read_times": 1,
      "content_en": "Allahumma bika asbahna wabika amsayna, wabika nahya ,wabika namootu wa-ilaykan-nushoor.",
      "content_id": "Allahumma bika ashbahna wa bika amsaina, wa bika nahya, wa bika namutu, wa ilaikan nusyuur.",
      "desc": "",
      "title": "٤-٢٣",
      "duration": 15000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_05.mp3",
      "period": "Morning",
      "order": 4,
      "content_ar": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ",
      "read_times": 1,
      "content_en": "Allahuma Anta Rabby La Ila Ila ‘Ant, Kalaqtani Wa ‘Ana Abduk, Wa ‘Ana ‘Alaa ‘Ahdeka Wa Wa’dika Ma Stata’t, A’uthu Beka min Shar Ma Sana’t Abu’u laka Be Ni’matika ‘Alay, Wa Abu’u Be Thanby, Fa Ighfir lee, Fa Inahu La Yaghfiru A Thunuba Ila Ant.",
      "content_id": "Allahumma anta rabbi, la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wawa'dika mastatha'tu, a'uudzubka min syarrimaa shana'tu, abuu'u laka bini'matika alayya wa abu'u laka bi dzanbi, faghfirli, fa innahu la yaghfirudzdzzunuba illa anta.",
      "desc": "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح",
      "title": "٥-٢٣",
      "duration": 43000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_06.mp3",
      "period": "Morning",
      "order": 5,
      "content_ar": "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
      "read_times": 4,
      "content_en": "Allahumma innee asbahtu oshhiduk, wa-oshhidu hamalata AAarshik, wamala-ikatak, wajameeAAa khalqik, annaka antal-lahu la ilaha illa ant, wahdaka la shareeka lak, wa-anna Muhammadan AAabduka warasooluk. ",
      "content_id": "Allahumma inni ashbahtu usyhiduka, wa usyhidu hamalata ‘arsyika, wa malaaikataka, wa jami’a khalqika, annaka antallahu laa ilaha illa anta wahdaka laa syarikalaka, wa anna Muhammadan ‘abduka wa rasuuluka.",
      "desc": "من قالها أعتقه الله من النار",
      "title": "٦-٢٣",
      "duration": 113000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_07.mp3",
      "period": "Morning",
      "order": 6,
      "content_ar": "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
      "read_times": 1,
      "content_en": "Allahumma ma asbaha bee min niAAmatin, aw bi-ahadin min khalqik, faminka wahdaka la shareeka lak, falakal-hamdu walakash-shukr",
      "content_id": "Allohumma ma ashbaha bi min ni'matin aw bi ahadin min kholqika, fa minka wahdaka la syarika laka, fa lakal hamdu wa lakasy syukr.",
      "desc": "من قالها حين يصبح أدى شكر يومه",
      "title": "٧-٢٣",
      "duration": 16000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_08.mp3",
      "period": "Morning",
      "order": 7,
      "content_ar": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ",
      "read_times": 3,
      "content_en": "Allahumma AAafinee fee badanee, allahumma AAafinee fee samAAee, allahumma AAafinee fee basaree, la ilaha illa ant.",
      "content_id": "Allahumma 'afini fi badanii, allahumma 'afini fi sam'ii, allahumma 'afini fi bashorii, la ilaaha illa anta.",
      "desc": "",
      "title": "٨-٢٣",
      "duration": 19000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_09.mp3",
      "period": "Morning",
      "order": 8,
      "content_ar": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ",
      "read_times": 3,
      "content_en": "Allahumma innee aAAoothu bika minal-kufr, walfaqr, wa-aAAoothu bika min AAathabil-qabr, la ilaha illa ant.",
      "content_id": "Allahumma inni a'udzubika minal kufri, wal faqri, wa a'uudzubika min 'adzaabil qabri, la ilaha illa anta.",
      "desc": "",
      "title": "٩-٢٣",
      "duration": 18000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_10.mp3",
      "period": "Morning",
      "order": 9,
      "content_ar": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَعَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم",
      "read_times": 7,
      "content_en": "Hasbiyal-lahu la ilaha illa huwa, AAalayhi tawakkalt, wahuwa rabbul-AAarshil-AAatheem",
      "content_id": "Hasbiyallahu la ilaha illa huwa 'alaihi tawakkaltu wa huwa rabbul 'arsyil 'adzim.",
      "desc": "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة",
      "title": "١٠-٢٣",
      "duration": 101000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_11.mp3",
      "period": "Morning",
      "order": 10,
      "content_ar": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي",
      "read_times": 1,
      "content_en": "Allahumma innee as-alukal-AAafwa walAAafiyah, fid-dunya wal-akhirah, allahumma innee as-alukal-AAafwa walAAafiyah fee deenee, wadunyaya wa-ahlee, wamalee, allahummas-tur AAawratee, wa-amin rawAAatee, allahumm ah-fathnee min bayni yaday, wamin khalfee, waAAan yameenee, waAAan shimalee, wamin fawqee, wa-aAAoothu bi AAathamatik an oghtala min tahtee.",
      "content_id": "Allahumma inni as-alukal ‘afwa wal ‘afiyata fid dunya wal akhiroh, allahumma inni as-alukal a’fwa wal ‘afiyata fi dini wa dunyaya wa ahli wa mali, allahummastur ‘auroti wa amin row’ati., allahummahfadzni min baini yadayya wa min kholfi wa min yamini wa ‘an syimali, wa min fauqi, wa a’uzubika bi ‘adzamatika an ughtaala min tahti.",
      "desc": "",
      "title": "١١-٢٣",
      "duration": 52000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_12.mp3",
      "period": "Morning",
      "order": 11,
      "content_ar": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم",
      "read_times": 1,
      "content_en": "Allahumma AAalimal-ghaybi washshahadah, fatiras-samawati wal-ard, rabba kulli shayin wamaleekah, ashhadu an la ilaha illa ant, aAAoothu bika min sharri nafsee wamin sharr al-shaytani washirkih, waan aqtarifa AAala nafsee soo-an aw aujurrahu ila muslim.",
      "content_id": "Allahuma ‘alimal ghoibi wasy syahaadah, faathiras samaawaati wal ard, robbi kulli sya’in wa maliikah, asyhadu anlaa ilaaha illaa anta, a'uudzubika min syarri nafsih, wa min syarri syaithon wa syirkihi, wa an aqtarifa ‘alaa nafsii suu’an aw ajurah ilaa muslim.",
      "desc": "",
      "title": "١٢-٢٣",
      "duration": 41000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_13.mp3",
      "period": "Morning",
      "order": 12,
      "content_ar": "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم",
      "read_times": 3,
      "content_en": "Bismil-lahil-lathee la yadurru maAAas-mihi shay-on fil-ardi wala fis-sama-i wahuwas-sameeAAul-AAaleem.",
      "content_id": "Bismillahilladzi laa yadhurru ma'asmihi syai'un fil ardhi wa la fis samaa'i wahuwas sami'ul alim.",
      "desc": "لم يضره من الله شيء",
      "title": "١٣-٢٣",
      "duration": 50000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_14.mp3",
      "period": "Morning",
      "order": 13,
      "content_ar": "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ نَبِيّـاً صلى الله عليه وسلم",
      "read_times": 3,
      "content_en": "Radheetu billahi rabban wabil-islami deenan wabi Muhammadin Salla Allah alayhi wa salam nabiyya.",
      "content_id": "Rodhitu billahi robba, wabil islami dina, wabimuhammadin nabiyya shallallaah 'alaihi wasallam.",
      "desc": "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة",
      "title": "١٤-٢٣",
      "duration": 48000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_15.mp3",
      "period": "Morning",
      "order": 14,
      "content_ar": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه",
      "read_times": 3,
      "content_en": "Subhana allah wabihamdih, AAadada khalqihi warida nafsih, wazinata AAarshih, wamidada kalimatih.",
      "content_id": "Subhanallahi wa bihamdihi 'adada khalqihi wa ridha nafsihi wa zinata 'arsyihi wa midada kalimatihi.",
      "desc": "",
      "title": "١٥-٢٣",
      "duration": 41000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_16.mp3",
      "period": "Morning",
      "order": 15,
      "content_ar": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ",
      "read_times": 100,
      "content_en": "Subhana allah wabihamdih.",
      "content_id": "Subhanallahi wa bihamdih.",
      "desc": "",
      "title": "١٦-٢٣",
      "duration": 25000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_17.mp3",
      "period": "Morning",
      "order": 16,
      "content_ar": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ",
      "read_times": 3,
      "content_en": "Ya hayyu ya qayyoom, birahmatika astagheeth, aslih lee sha/nee kullah, wala takilnee ila nafsee tarfata AAayn.",
      "content_id": "Ya hayyu ya qoyyum bi rahmatika astaghiits, wa ash-lihlii sya'nii kullahu wa laa takilnii ilaa nafsii thorfata 'ainin.",
      "desc": "",
      "title": "١٧-٢٣",
      "duration": 18000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_18.mp3",
      "period": "Morning",
      "order": 17,
      "content_ar": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ",
      "read_times": 100,
      "content_en": "La ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer.",
      "content_id": "Laa ilaha illallah wahdahu laa syarika lah. Lahul mulku wa lahul hamdu wa huwa 'ala kulli syai-in qodiir.",
      "desc": "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان",
      "title": "١٨-٢٣",
      "duration": 39000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_19.mp3",
      "period": "Morning",
      "order": 18,
      "content_ar": "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه",
      "read_times": 1,
      "content_en": "Asbahna wa-asbahal-mulku lillahi rabbil-AAalameen, Allahumma innee as-aluka khayra hathal-yawm, fat-hahu, wanasrahu, wanoorahu, wabarakatahu, wahudahu, wa-aAAoothu bika min sharri ma feehi, washarri ma baAAdah.",
      "content_id": "Asbahna wa asbahal mulku lillaahi rabbil 'aalamiin, allahumma innii as'aluka khoira haadzal yaum, fathahu, wanasrahu, wanuurahu, wabarakatahu, wahudahu, wa a'uudzubika min syarri maa fiihu wa syarri ma ba'dah.",
      "desc": "",
      "title": "١٩-٢٣",
      "duration": 29000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_20.mp3",
      "period": "Morning",
      "order": 19,
      "content_ar": "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ",
      "read_times": 1,
      "content_en": "Asbahna AAala fitratil-islam, waAAala kalimatil-ikhlas, waAAala deeni nabiyyina Muhammad  (salla Allah alayhi wasalam) waAAala millati abeena Ibraheem, haneefan musliman wama kana min al-mushrikeen",
      "content_id": "Ashbahna ‘ala fitratil Islam, wa’ ala kalimatil Ikhlas, wa’ ala diini nabiyina Muhammad (shallallaahu 'alaihi wasallam), wa’ala milati abina Ibrahim, Hanifan musliman wa ma kana minal musyrikin.",
      "desc": "",
      "title": "٢٠-٢٣",
      "duration": 32000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_21.mp3",
      "period": "Morning",
      "order": 20,
      "content_ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
      "read_times": 1,
      "content_en": "Allahumma inni as’aluka ‘ilman nafi’an, wa rizqan tayyiban, wa ‘amalan mutaqabbalan.",
      "content_id": "Allahumma inni as’aluka ‘ilman naafi’an, wa rizqan thayyiban, wa ‘amalan mutaqabbalan.",
      "desc": "",
      "title": "٢١-٢٣",
      "duration": 14000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_22.mp3",
      "period": "Morning",
      "order": 21,
      "content_ar": "اللَّهُمَّ صَلِّ وَسَلِّمْ على نَبِيِّنَا مُحمَّد",
      "read_times": 10,
      "content_en": "allahuma ṣale wasallim Ala nabiyena muḥammad",
      "content_id": "Allahumma shalli wasallim 'alaa nabiyyinaa Muhammad.",
      "desc": "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة",
      "title": "٢٢-٢٣",
      "duration": 69000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/mazkar_23.mp3",
      "period": "Morning",
      "order": 22,
      "content_ar": "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
      "read_times": 100,
      "content_en": "astaghfirullah wa atubu ilaih",
      "content_id": "Astaghfirullah wa atuubu ilaih.",
      "desc": "",
      "title": "٢٣-٢٣",
      "duration": 23000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_01.mp3",
      "period": "Evening",
      "order": 23,
      "content_ar": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ\r\n الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ۖ وَلَا يَؤُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
      "read_times": 1,
      "content_en": "\"A'uzu billahi min ashaitanir rajim\n\"\"Allahu la ilaha illa Huwa, Al-Haiyul-Qaiyum La ta'khudhuhu sinatun wa la nawm, lahu ma fis-samawati wa ma fil-'ard Man dhal-ladhi yashfa'u 'indahu illa bi-idhnihi Ya'lamu ma baina aidihim wa ma khalfahum, wa la yuhituna bi shai'im-min 'ilmihi illa bima sha'a Wasi'a kursiyuhus-samawati wal ard, wa la ya'uduhu hifdhuhuma Wa Huwal 'Aliyul-Adheem\"\"\"",
      "content_id": "A'udzubillahi minasy syaithaanirrajiim. \"Allahu laa ilaaha illa huwalhayyul qayyuum laa ta khudzuhuu sinatuwwalaa nawum lahuu maa fiissamaa wati wa maa fil ardhi man dzalladzii yasyfa'u 'indahuu illa bi idznihii ya'lamu maa baina aydiihim wa maa khalfahum wa laa yuhiithuna bisyaiin min 'ilmihii illaa bimaa syaa wa si'a kursiyyuhus samaa waati wal ardhi wa laa yauduhuu hifdzuhumaa wa huwal 'aliyyul 'adziim.\"",
      "desc": "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح",
      "title": "١-٢٢",
      "duration": 78000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_02.mp3",
      "period": "Evening",
      "order": 24,
      "content_ar": "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ \r\nقُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ.\r\n بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ\r\n قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِنْ شَرِّ مَا خَلَقَ، وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ.\r\n بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ \r\nقُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَٰهِ النَّاسِ، مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ، مِنَ الْجِنَّةِ وَالنَّاسِ.",
      "read_times": 3,
      "content_en": "Bismillah, ar-Rahman, ar-Rahim\n\"Qul huwa Allahu ahad ,Allahu assamad , Lam yalid walam yoolad , Walam yakun lahu kufuwan ahad \"\nBismillah, ar-Rahman, ar-Rahim\n\"Qul aAAoothu birabbi alfalaq ,Min sharri ma khalaq , Wamin sharri ghasiqin ithawaqab, Wamin sharri annaffathatifee alAAuqad ,Wamin sharri hasidin itha hasad\"\nBismillah, ar-Rahman, ar-Rahim\n \"Qul aAAoothu birabbi annas , Maliki annas , Ilahi annas , Min sharri alwaswasi alkhannas , Allathee yuwaswisu fee sudoori annas , Mina aljinnati wannas\"",
      "content_id": "Bismillahirrahmaanirrahiim. \"Qul huwallahu ahad. Allahush shamad. Lam yalid walam yuulad.Walam yakul lahuu kuffuwan ahad.\" Bismillahirrahmaanirrahiim. \"Qul a'udzu birabbil falaq.Min syarrimaa khalaq.Wa min syarri ghaasiqin idzaa wa qab.Wa min syarrinnaffaats tsaati fil 'uqad.Wa min syarri haasidin idza hasad.\" Bismillahirrahmaanirrahiim. \"Qul a'udzu birrabinnaasi. Malikinnaasi. Ilaahinnaasi. Min syarril waswaasil khannaas. Al ladzii yuwas wisu fii shuduurinnaas. Minnal jinnati wannaas.\"",
      "desc": "من قالها حين يصبح وحين يمسى كفته من كل شىء",
      "title": "٢-٢٢",
      "duration": 285000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_03.mp3",
      "period": "Evening",
      "order": 25,
      "content_ar": "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
      "read_times": 1,
      "content_en": "Amsayna wa-amsal-mulku lillah walhamdu lillah la ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shayin qadeer, rabbi as-aluka khayra ma fee hathihil-laylah, wakhayra ma baAAdaha, wa-aAAoothu bika min sharri hathihil-laylah, washarri ma baAAdaha, rabbi aAAoothu bika minal-kasal, wasoo-il kibar, rabbi aAAoothu bika min AAathabin fin-nar, waAAathabin fil-qabr.",
      "content_id": "Amsainaa wa amsal mulku lillah walhamdulillah, laa ilaha illallah wahdahu laa syarika lah, lahul mulku walahul hamdu wa huwa ‘ala kulli syai-in qodir. Robbi as-aluka khoiro maa fii hadzihil lailah wa khoiro maa ba’dahaa, wa a’udzu bika min syarri maa fii hadzihil lailah wa syarri maa ba’dahaa. Robbi a’udzu bika minal kasali wa suu-il kibar. Robbi a’udzu bika min ‘adzabin fin naari wa ‘adzabin fil qobri.",
      "desc": "",
      "title": "٣-٢٢",
      "duration": 59000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_04.mp3",
      "period": "Evening",
      "order": 26,
      "content_ar": "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ",
      "read_times": 1,
      "content_en": "\"Allahumma bika amsayna, wabika asbahna, wabika nahya wabika namootu wa-ilaykal-maseer.\n\"",
      "content_id": "Allahumma bika amsaina, wa bika asbahna, wa bika nahyaa, wa bika namuutu, wa ilaikal mashiir.",
      "desc": "",
      "title": "٤-٢٢",
      "duration": 14000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_05.mp3",
      "period": "Evening",
      "order": 27,
      "content_ar": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
      "read_times": 1,
      "content_en": "Allahuma Anta Rabby La Ila Ila ‘Ant, Kalaqtani Wa ‘Ana Abduk, Wa ‘Ana ‘Alaa ‘Ahdeka Wa Wa’dika Ma Stata’t, A’uthu Beka min Shar Ma Sana’t Abu’u laka Be Ni’matika ‘Alay, Wa Abu’u Be Thanby, Fa Ighfir lee, Fa Inahu La Yaghfiru A Thunuba Ila Ant.",
      "content_id": "Allahumma anta rabbi, la ilaha illa anta khalaqtani, wa ana 'abduka, wa ana ala ahdika wawa'dika mastatha'tu, audzubka min syarrima shana'tu, abu'u laka bini'matika alayya wa abu'u laka bi dzanbi, faghfirli, fa innahu la yaghfirudzunuba illa anta.",
      "desc": "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح",
      "title": "٥-٢٢",
      "duration": 43000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_06.mp3",
      "period": "Evening",
      "order": 28,
      "content_ar": "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
      "read_times": 4,
      "content_en": "Allahumma innee amsaytu oshhiduk, wa-oshhidu hamalata AAarshik, wamala-ikatak, wajameeAAa khalqik, annaka antal-lahu la ilaha illa ant, wahdaka la shareeka lak, wa-anna Muhammadan AAabduka warasooluk. ",
      "content_id": "Allahumma inni amsaitu usyhiduka wa usyhidu hamalata ‘arsyika, wa malaaikataka ,wa jamii’a khalqika, annaka antallahu laa ilaha illa anta wahdaka laa syarikalaka. Wa anna Muhammadan ‘abduka wa rasuuluka.",
      "desc": "من قالها أعتقه الله من النار",
      "title": "٦-٢٢",
      "duration": 117000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_07.mp3",
      "period": "Evening",
      "order": 29,
      "content_ar": "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
      "read_times": 1,
      "content_en": "Allahumma ma amsa bee min niAAmatin, aw bi-ahadin min khalqik, faminka wahdaka la shareeka lak, falakal-hamdu walakash-shukr.",
      "content_id": "Allahumma maa amsa bii min ni’matin au bi ahadin min kholqika faminka wahdaka laa syarikalaka, falakalhamdu walakasy syukru.",
      "desc": "من قالها حين يمسى أدى شكر يومه",
      "title": "٧-٢٢",
      "duration": 17000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_08.mp3",
      "period": "Evening",
      "order": 30,
      "content_ar": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ",
      "read_times": 3,
      "content_en": "Allahumma AAafinee fee badanee, allahumma AAafinee fee samAAee, allahumma AAafinee fee basaree, la ilaha illa ant.",
      "content_id": "Allahumma 'afini fi badani, allahumma 'afini fi sam'i, allahumma 'afini fi bashori la ilaha illa anta.",
      "desc": "",
      "title": "٨-٢٢",
      "duration": 19000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_09.mp3",
      "period": "Evening",
      "order": 31,
      "content_ar": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ",
      "read_times": 3,
      "content_en": "Allahumma innee aAAoothu bika minal-kufr, walfaqr, wa-aAAoothu bika min AAathabil-qabr, la ilaha illa ant.",
      "content_id": "Allahumma inni a'udzubika minal kufri wal faqri wa a'udzubika min 'adzaabil qabri, laa ilaha illa anta.",
      "desc": "",
      "title": "٩-٢٢",
      "duration": 18000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_10.mp3",
      "period": "Evening",
      "order": 32,
      "content_ar": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم",
      "read_times": 7,
      "content_en": "Hasbiyal-lahu la ilaha illa huwa, AAalayhi tawakkalt, wahuwa rabbul-AAarshil-AAatheem.",
      "content_id": "Hasbiyallahu la ilaha illa huwa 'alaihi tawakkaltu wa huwa rabbul 'arsyil 'adziim.",
      "desc": "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة",
      "title": "١٠-٢٢",
      "duration": 101000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_11.mp3",
      "period": "Evening",
      "order": 33,
      "content_ar": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق",
      "read_times": 3,
      "content_en": "aAAoothu bikalimatil-lahit-tammati min sharri ma  khalaq.",
      "content_id": "A'uudzu bikalimaa tillaahittaammaati min syarri maa kholaq.",
      "desc": "لم يضره من الله شيء",
      "title": "١١-٢٢",
      "duration": 30000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_12.mp3",
      "period": "Evening",
      "order": 34,
      "content_ar": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي",
      "read_times": 1,
      "content_en": "Allahumma innee as-alukal-AAafwa walAAafiyah, fid-dunya wal-akhirah, allahumma innee as-alukal-AAafwa walAAafiyah fee deenee, wadunyaya wa-ahlee, wamalee, allahummas-tur AAawratee, wa-amin rawAAatee, allahumm ah-fathnee min bayni yaday, wamin khalfee, waAAan yameenee, waAAan shimalee, wamin fawqee, wa-aAAoothu bi AAathamatik an oghtala min tahtee.",
      "content_id": "Allahumma inni as-alukal ‘afwa wal ‘afiyata fid dunya wal akhiroh. Allahumma inni as-alukal a’fwa wal ‘afiyata fi dini wa dunyaya wa ahli wa mali. Allahummastur ‘auroti wa amin row’ati. Allahummahfadzni min baini yadayya wa min kholfi wa min yamini wa ‘an syimali wa min fauqi wa a’uzubika bi ‘adzamatika an ughtala min tahti.",
      "desc": "",
      "title": "١٢-٢٢",
      "duration": 52000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_13.mp3",
      "period": "Evening",
      "order": 35,
      "content_ar": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
      "read_times": 1,
      "content_en": "Allahumma AAalimal-ghaybi washshahadah, fatiras-samawati wal-ard, rabba kulli shayin wamaleekah, ashhadu an la ilaha illa ant, aAAoothu bika min sharri nafsee wamin sharr al-shaytani washirkih, waan aqtarifa AAala nafsee soo-an aw aujurrahu ila muslim.",
      "content_id": "Allahuma ‘alimal ghoibi wa syahadah, Fathiras samawati wal ‘ard, Robbi kulli sya’in wa malikah, Ashadu ala ilaha ila Anta, Audzubika min syari Nafsih, wa min syarri syaithon wa syirkihi,wa an aqtarifa ‘ala nafsi suu’an aw ajurah ila muslim.",
      "desc": "",
      "title": "١٣-٢٢",
      "duration": 41000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_14.mp3",
      "period": "Evening",
      "order": 36,
      "content_ar": "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم",
      "read_times": 3,
      "content_en": "Bismil-lahil-lathee la yadurru maAAas-mihi shay-on fil-ardi wala fis-sama-i wahuwas-sameeAAul-AAaleem. ",
      "content_id": "Bismillahilladzi laa yadhurru ma'asmihi syai'un fil ardhi wa la fis samaa'i wahuwas sami'ul alim.",
      "desc": "لم يضره من الله شيء",
      "title": "١٤-٢٢",
      "duration": 50000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_15.mp3",
      "period": "Evening",
      "order": 37,
      "content_ar": "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ نَبِيّـاً صلى الله عليه وسلم",
      "read_times": 3,
      "content_en": "Radheetu billahi rabban wabil-islami deenan wabi Muhammadin Salla Allah alayhi wa salam nabiyya.",
      "content_id": "Radhiitu billaahi rabba, wabil islaami diina, wabi Muhammadin shallaallaahu 'alaihi wasallam.",
      "desc": "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة",
      "title": "١٥-٢٢",
      "duration": 48000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_16.mp3",
      "period": "Evening",
      "order": 38,
      "content_ar": "سُبْحـانَ اللهِ وَبِحَمْـدِهِ",
      "read_times": 100,
      "content_en": "Subhana allah wabihamdih.",
      "content_id": "Subhanallaahi wabihamdihi.",
      "desc": "",
      "title": "١٦-٢٢",
      "duration": 25000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_17.mp3",
      "period": "Evening",
      "order": 39,
      "content_ar": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ",
      "read_times": 3,
      "content_en": "Ya hayyu ya qayyoom, birahmatika astagheeth, aslih lee sha/nee kullah, wala takilnee ila nafsee tarfata AAayn.",
      "content_id": "Ya hayyu ya qoyyum bi rahmatika astaghiits, wa ash-lihlii sya'nii kullahu wa laa takilnii ilaa nafsii thorfata 'ainin.",
      "desc": "",
      "title": "١٧-٢٢",
      "duration": 19000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_18.mp3",
      "period": "Evening",
      "order": 40,
      "content_ar": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
      "read_times": 100,
      "content_en": "La ilaha illal-lah, wahdahu la shareeka lah, lahul-mulku walahul-hamd, wahuwa AAala kulli shay-in qadeer.",
      "content_id": "Laa ilaha illallah wahdahu laa syarika lah. Lahul mulku wa lahul hamdu wa huwa 'ala kulli syai-in qodiir.",
      "desc": "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان",
      "title": "١٨-٢٢",
      "duration": 124000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_19.mp3",
      "period": "Evening",
      "order": 41,
      "content_ar": "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.",
      "read_times": 1,
      "content_en": "Amsayna wa-amsal-mulku lillahi rabbil-AAalameen, allahumma innee as-aluka khayra hathihil-laylah, fat-haha, wanasraha,wanooraha, wabarakataha, wahudaha, wa-aAAoothu bika min sharri ma feeha washarri ma baAAdaha.",
      "content_id": "Amsaina wa amsal mulku lillaahi rabbil 'aalamiin, allahumma innii as'aluka khoira haadzihil lailah, fathahaa, wanasrahaa, wanuurahaa, wabarakatahaa, wahudahaa, wa a'uudzubika min syarri maa fiihi wa syarri ma ba'dahaa.",
      "desc": "",
      "title": "١٩-٢٢",
      "duration": 32000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_20.mp3",
      "period": "Evening",
      "order": 42,
      "content_ar": "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
      "read_times": 1,
      "content_en": "\"Amsayna AAala fitratil-islam, waAAala kalimatil-ikhlas, waAAala deeni nabiyyina Muhammad r waAAala millati abeena\nIbraheem, haneefan musliman wama kana minal-mushrikeen.\"",
      "content_id": "Amsaina ‘ala fitratil Islam, wa’ ala kalimatil ikhlas wa’ alaa diini nabiyyina Muhammad wa’alaa millati abiina Ibraahiima haniifan musliman wa maa kaana minal musyrikiin.",
      "desc": "",
      "title": "٢٠-٢٢",
      "duration": 34000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_21.mp3",
      "period": "Evening",
      "order": 43,
      "content_ar": "اللَّهُمَّ صَلِّ وَسَلِّمْ على نَبِيِّنَا مُحمَّد",
      "read_times": 10,
      "content_en": "allahuma ṣale wasallim Ala nabiyena muḥammad",
      "content_id": "Allaahumma shalli wasallim 'alaa nabiyyinaa Muhammad.",
      "desc": "من صلى علىحين يصبح وحين يمسى ادركته شفاعتى يوم القيامة",
      "title": "٢١-٢٢",
      "duration": 69000
    },
    {
      "audio_url": "https://cdn.mymuslimdaily.com/res/athkar/eazkar_22.mp3",
      "period": "Evening",
      "order": 44,
      "content_ar": "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
      "read_times": 100,
      "content_en": "astaghfirullah wa atubu ilaih",
      "content_id": "Astaghfirullaah wa atuubu ilaih.",
      "desc": "",
      "title": "٢٢-٢٢",
      "duration": 20000
    }
  ]
}