{
    "hadist": [
        {
            "category_name": "Morning & Evening",
            "category_no": 1,
            "icon" : "assets/icon/praying.png",
            "chapter_count": 6,
            "chapters": [
                {
                    "chapter_name": "When waking up",
                    "chapter_no": 1,
                    "verses": [
                        {
                            "arabic_text": "اَلْحَمْدُ لِلَّهِ الَّذي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
                            "duration": 12000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_1_1.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_001.mp3",
                            "verse_no": 1,
                            "verse_text": "Praise is to Allah Who gives us life after He has caused us to die and to Him is the return."
                        },
                        {
                            "arabic_text": "لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحاَنَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي",
                            "duration": 40000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_1_2.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_002.mp3",
                            "verse_no": 2,
                            "verse_text": "There is none worth of worship but Allah alone, Who has no partner, His is the dominion and to Him belongs all praise, and He is able to do all things. Glory is to Allah. Praise is to Allah. There is none worth of worship but Allah. Allah is the Most Great. There is no might and no power except by Allah's leave, the Exalted, the Mighty. My Lord, forgive me.\n(Whoever says this will be forgiven, and if he supplicates Allah, his prayer will be answered; if he performs ablution and prays, his prayer will be accepted.)"
                        },
                        {
                            "arabic_text": "الْحَمْدُ للّهِ الَّذِي عَافَانِي فِي جَسَدِيْ، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهِ",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_1_3.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_003.mp3",
                            "verse_no": 3,
                            "verse_text": "Praise is to Allah Who gave strength to my body and returned my soul to me and permitted me to remember Him."
                        },
                        {
                            "arabic_text": "إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِأُولِي الأَلْبَابِ، الَّذِينَ يَذْكُرُونَ اللهَ قِيَامًا وَقُعُودًا وَعَلَى جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ، رَبَّنَا إِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنْصَارٍ، رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ، رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ، فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِنْكُمْ مِنْ ذَكَرٍ أَوْ أُنْثَى بَعْضُكُمْ مِنْ بَعْضٍ فَالَّذِينَ هَاجَرُوا وَأُخْرِجُوا مِنْ دِيَارِهِمْ وَأُوذُوا فِي سَبِيلِي وَقَاتَلُوا وَقُتِلُوا لَأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِم",
                            "duration": 308000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_1_4.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_004.mp3",
                            "verse_no": 4,
                            "verse_text": "Indeed, in the creation of the heavens and the earth and the alternation of the night and the day are signs for those of understanding.190 Who remember Allah while standing or sitting or (lying) on their sides and give thought to the creation of the heavens and the earth, (saying), \"Our Lord, You did not create this aimlessly; exalted are You (above such a thing); then protect us from the punishment of the Fire.191 Our Lord, indeed whoever You admit to the Fire - You have disgraced him, and for the wrongdoers there are no helpers.192 Our Lord, indeed we have heard a caller calling to faith, (saying), 'Believe in your Lord,' and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.193 Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in (Your) promise.194 And their Lord responded to them, \"Never will I allow to be lost the work"
                        }
                    ]
                },
                {
                    "chapter_name": "Remembrance In the morning and evening",
                    "chapter_no": 27,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ. اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
                            "duration": 76000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_75.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_075.mp3",
                            "verse_no": 75,
                            "verse_text": "I seek refuge in Allah from Satan the outcast. - Allah! There is none worthy of worship but He, the Ever Living, the One Who sustains and protects all that exists. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them in this world, and what will happen to them in the Hereafter. And they will never encompass anything of His Knowledge except that which He wills. His Throne extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great.(Whoever says this when he rises in the morning will be protected from jinns until he retires in the evening, and whoever says it when retiring in the evening will be protected from them until he rises in the morning.)"
                        },
                        {
                            "arabic_text": "قُلْ هُوَ اللَّـهُ أَحَدٌ، اللَّـهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ.\n\nقُلْ أَعُوذُ بِرَ‌بِّ الْفَلَقِ، مِن شَرِّ‌ مَا خَلَقَ، وَمِن شَرِّ‌ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ‌ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ‌ حَاسِدٍ إِذَا حَسَدَ.\n\nقُلْ أَعُوذُ بِرَ‌بِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَـٰهِ النَّاسِ، مِن شَرِّ‌ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ‌ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ.\n",
                            "duration": 102000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_76.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_076.mp3",
                            "verse_no": 76,
                            "verse_text": "Recite Al-Ikhlas, Al-Falaq and An-Nas.(Whoever recites these Three times in the morning and in the evening, they will suffice him (as a protection) against everything.)"
                        },
                        {
                            "arabic_text": "أَصْبَحْنَا وَأَصْبَحَ (اَمْسَيْنَا وَاَمْسَ) الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا الْيَوْمِ (اللَّيْلَةِ) وَخَيْرَ مَا بَعْدَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ (اللَّيْلَةِ) وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ، وَسُوءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِيْ النَّارِ وَعَذَابٍ فِيْ الْقَبْرِ",
                            "duration": 78000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_77.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_077.mp3",
                            "verse_no": 77,
                            "verse_text": "We have entered the morning (evening) and with it all dominion is Allah's. Praise is to Allah. None has the right to be worshiped but Allah alone, Who has no partner. To Allah belongs the dominion, and to Him is the praise and He is Able to do all things. My Lord, I ask You for the goodness of this day and of the days that come after it, and I seek refuge in You from the evil of this day and of the days that come after it. My Lord, I seek refuge in You from laziness and helpless old age. My Lord, I seek refuge in You from the punishment of Hell-fire, and from the punishment of the grave. (Recite in the bracket in the evening.)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ بِكَ أَصْبَحْنَا (أَمْسَـينا)، وَبِكَ أَمْسَيْنَا (أَصْبَحْنَا)، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ",
                            "duration": 21000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_78.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_078.mp3",
                            "verse_no": 78,
                            "verse_text": "O Allah, by You we enter the morning (evening) and by You we enter the evening (morning), by You we live and and by You we die, and to You is our resurrection. (Recite in the bracket in the evening.)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ أَنْتَ رَبِّي لَّا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِر لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
                            "duration": 47000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_79.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_079.mp3",
                            "verse_no": 79,
                            "verse_text": "O Allah, You are my Lord, there is none worthy of worship but You. You created me and I am your slave. I keep Your covenant, and my pledge to You so far as I am able. I seek refuge in You from the evil of what I have done. I admit to Your blessings upon me, and I admit to my misdeeds. Forgive me, for there is none who may forgive sins but You.(Whoever recites this with conviction in the evening and dies during that night shall enter Paradise, and whoever recites it with conviction in the morning and dies during that day shall enter Paradise.)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَصْبَحْتُ (اَمْسَيْتُ) أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ",
                            "duration": 38000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_80.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_080.mp3",
                            "verse_no": 80,
                            "verse_text": "O Allah, I have entered the morning (evening) and I witness You and witness the bearers of Your Throne, and Your angels and all of Your creation to witness that You are Allah, there is none worthy of worship but You alone, You have no partners, and that Muhammad is Your slave and Your Messenger. (Recite in the bracket in the evening.) (Allah will spare whoever says this four times in the morning or evening from the fire of Hell.)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ مَا أَصْبَحَ(أََمْسَ) بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_81.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_081.mp3",
                            "verse_no": 81,
                            "verse_text": "O Allah, whatever blessing has been received by me in the morning (evening) or anyone of Your creation is from You alone, You have no partner. All praise is for you and thanks is to You. (Recite in the bracket in the evening.) (Whoever recites this in the morning, has completed his obligation to thank Allah for that day; and whoever says it in the evening, has completed his obligation for that night.)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ عَافِـني فِي بَدَنِي، اللَّهُمَّ عَافِـنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنَ الْكُفْر، وَالفَقْرِ، وَأَعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ ، لَا إلَهَ إلاَّ أَنْتَ",
                            "duration": 50000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_82.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_082.mp3",
                            "verse_no": 82,
                            "verse_text": "O Allah, make me healthy in my body. O Allah, preserve for me my hearing. O Allah, preserve for me my sight. There is none worthy of worship but You. O Allah, I seek refuge in You from disbelief and poverty and I seek refuge in You from the punishment of the grave. There is none worthy of worship but You. (Three times)"
                        },
                        {
                            "arabic_text": "حَسْبِيَ اللَّهُ لَآ إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_83.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_083.mp3",
                            "verse_no": 83,
                            "verse_text": "Allah is sufficient for me. There is none worthy of worship but Him. I have placed my trust in Him, He is Lord of the Majestic Throne. (Seven times)(Allah will grant whoever recites this Seven times in the morning or evening whatever he desires from this world or the next.)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي، وَدُنْيَايَ، وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيَ",
                            "duration": 63000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_84.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_084.mp3",
                            "verse_no": 84,
                            "verse_text": "O Allah, I seek Your forgiveness and Your protection in this world and the next. O Allah, I seek Your forgiveness and Your protection in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my secrets and preserve me from anguish. O Allah, guard me from what is in front of me and behind me, from my left, and from my right, and from above me. I seek refuge in Your Greatness from being struck down from beneath me."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّماوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
                            "duration": 45000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_85.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_085.mp3",
                            "verse_no": 85,
                            "verse_text": "O Allah, Knower of the unseen and the evident , Maker of the heavens and the earth, Lord of everything and its Possessor, I bear witness that there is none worthy of worship but You. I seek refuge in You from the evil of my soul and from the evil of Satan and his helpers. (I seek refuge in You) from bringing evil upon my soul and from harming any Muslim."
                        },
                        {
                            "arabic_text": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الَْأرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
                            "duration": 21000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_86.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_086.mp3",
                            "verse_no": 86,
                            "verse_text": "In the Name of Allah, Who with His Name nothing can cause harm in the earth nor in the heavens, and He is the All-Hearing, the All-Knowing. (Three times)(Whoever recites it in the morning will not be afflicted by any calamity before evening, and whoever recites it in the evening will not be overtaken by any calamity before morning.)"
                        },
                        {
                            "arabic_text": "رَضِيتُ باللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِيناً، وَبِمُحَمَّدٍ صَلَى اللَّهُ عَلِيهِ وَسَلَّمَ نَبِيَّاً",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_87.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_087.mp3",
                            "verse_no": 87,
                            "verse_text": "I am pleased with Allah as my Lord, with Islam as my religion and with Muhammad (peace and blessings of Allah be upon him) as my Prophet. (Three times)(Allah has promised that anyone who says every morning or evening will be pleased on the Day of Resurrection.)"
                        },
                        {
                            "arabic_text": "يَاحَيُّ، يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
                            "duration": 21000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_88.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_088.mp3",
                            "verse_no": 88,
                            "verse_text": "O Ever Living One, O Eternal One, by Your mercy I call on You to set right all my affairs. Do not place me in charge of my soul even for the blinking of an eye."
                        },
                        {
                            "arabic_text": "أَصْبَحْنَا وَأَصْبَحَ (أَمْسَيْنا وَأَمْسَى) الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُمَّ إِنِّـي أَسْأَلُكَ خَـيْرَ هَذَا الْـيَوْمِ (اللَّـيْلَة)، فَتْحَهُ، وَنَصْرَهُ، وَنُورَهُ وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ",
                            "duration": 39000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_89.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_089.mp3",
                            "verse_no": 89,
                            "verse_text": "We have entered the morning (evening) and with it all the dominion which belongs to Allah, Lord of all that exists. O Allah, I ask You for the goodness of this day, its victory, its help, its light, its blessings, and its guidance. I seek refuge in You from the evil that is in it and from the evil that follows it.(Recite in the bracket in the evening.)"
                        },
                        {
                            "arabic_text": "أَصْبَحْنَا (أَمْسَيْنَا) عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الإِخْلَاصِ، وَعَلَى دِينِ نَبِـيِّنَا مُحَمَّدٍ، وَعَاـَى مِلَّـةِ أَبِينَا إِبْـرَاهِيـمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
                            "duration": 32000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_90.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_090.mp3",
                            "verse_no": 90,
                            "verse_text": "We have entered the morning (evening) upon the natural religion of Islam, the word of sincere devotion, the religion of our Prophet Muhammad (peace and blessings of Allah be upon him), and the faith of our father Ibrahim. He was upright (in worshipping Allah), and a Muslim. He was not of those who worship others besides Allah. (Recite in the bracket in the evening.)"
                        },
                        {
                            "arabic_text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
                            "duration": 4000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_91.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_091.mp3",
                            "verse_no": 91,
                            "verse_text": "Glory is to Allah and praise is to Him. (100 times)(Whoever recites this one hundred times in the morning and in the evening will not be surpassed on the Day of Resurrection by anyone having done better than this except for someone who had recited it more.)"
                        },
                        {
                            "arabic_text": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_92.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_092.mp3",
                            "verse_no": 92,
                            "verse_text": "None has the right to be worshiped but Allah alone, Who has no partner. His is the dominion and His is the praise and He is Able to do all things. (10 times or once if tired.)"
                        },
                        {
                            "arabic_text": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                            "duration": 20000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_93.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_093.mp3",
                            "verse_no": 93,
                            "verse_text": "None has the right to be worshiped but Allah alone, Who has no partner. His is the dominion and His is the praise and He is Able to do all things. (100 times in in the morning.)(Whoever recites this hundred times in the morning, Allah swt will reward him of freeing ten slaves, Allah will write one hundred Hasanat and and forgive him one hundred misdeeds and be protected from Satan until evening.)"
                        },
                        {
                            "arabic_text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
                            "duration": 17000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_94.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_094.mp3",
                            "verse_no": 94,
                            "verse_text": "Glory is to Allah and praise is to Him, by the multitude of His creation, by His Pleasure, by the weight of His Throne, and by the extent of His Words. (Three times in the morning.)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَ رِزْقاً طَيِّباً، وَ عَمَلاً مُتَقَبَّلاً",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_95.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_095.mp3",
                            "verse_no": 95,
                            "verse_text": "O Allah, I ask You for knowledge that is of benefit, a good provision, and deeds that will be accepted. (Recite in the morning.)"
                        },
                        {
                            "arabic_text": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
                            "duration": 6000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_96.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_096.mp3",
                            "verse_no": 96,
                            "verse_text": "I seek the forgiveness of Allah and repent to Him. (100 times during the day.)"
                        },
                        {
                            "arabic_text": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_97.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_097.mp3",
                            "verse_no": 97,
                            "verse_text": "I seek refuge in the Perfect Words of Allah from the evil of what He has created. (Three times in the evening.)(Whoever recites this Three times in the evening will be protected from insect stings.)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ صَلِّ وَسَلَّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_27_98.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_098.mp3",
                            "verse_no": 98,
                            "verse_text": "Oh Allah, we ask you for peace and blessings upon our prophet Muhammad. (Ten times)(The Prophet saw said: \"Who recites blessings upon me 10 times in the morning and 10 times in the evening will obtain my intercession on the Day of Resurrection\".)"
                        }
                    ]
                },
                {
                    "chapter_name": "Before sleeping",
                    "chapter_no": 28,
                    "verses": [
                        {
                            "arabic_text": "قُلْ هُوَ اللَّـهُ أَحَدٌ، اللَّـهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ.\n\nقُلْ أَعُوذُ بِرَ‌بِّ الْفَلَقِ، مِن شَرِّ‌ مَا خَلَقَ، وَمِن شَرِّ‌ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ‌ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ‌ حَاسِدٍ إِذَا حَسَدَ.\n\nقُلْ أَعُوذُ بِرَ‌بِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَـٰهِ النَّاسِ، مِن شَرِّ‌ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ‌ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ.",
                            "duration": 113000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_99.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_099.mp3",
                            "verse_no": 99,
                            "verse_text": "Recite Al-Ikhlas, Al-Falaq and An-Nas"
                        },
                        {
                            "arabic_text": "اللَّهُ لَا إِلَهَ\n إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
                            "duration": 72000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_100.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_100.mp3",
                            "verse_no": 100,
                            "verse_text": "Allah! There is no God but He, the Ever Living, the One Who sustains and protects all that exists. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them in this world, and what will happen to them in the Hereafter. And they will never encompass anything of His Knowledge except that which He wills. His Throne extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great.(Whoever reads this when he lies down to sleep will have a guardian from Allah remain with him and Satan will not be able to come near him until he rises in the morning.)"
                        },
                        {
                            "arabic_text": "(1)آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ(2)لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
                            "duration": 121000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_101.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_101.mp3",
                            "verse_no": 101,
                            "verse_text": "The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, (saying), \"We make no distinction between any of His messengers.\" And they say, \"We hear and we obey. (We seek) Your forgiveness, our Lord, and to You is the (final) destination.\"(1)Allah does not charge a soul except (with that within) its capacity. It will have (the consequence of) what (good) it has gained, and it will bear (the consequence of) what (evil) it has earned. \"Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.\"(2)(These two Verses will be sufficient for anyone who recites them at night before s"
                        },
                        {
                            "arabic_text": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
                            "duration": 26000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_102.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_102.mp3",
                            "verse_no": 102,
                            "verse_text": "With Your Name my Lord, I lay myself down and with Your Name I rise. And if my soul You take, have mercy on it, and if You send it back then protect it as You protect Your righteous slaves.(If any of you rises from his bed and later returns to it, let him dust off his bed with his waist garment three times and mention the Name of Allah, for he does not know what may have entered the bed after him, and when he lies down he should say: بِسْمِ اللَّهِ"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فََاغْفِرْ لَهَا، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ",
                            "duration": 34000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_103.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_103.mp3",
                            "verse_no": 103,
                            "verse_text": "O Allah, You have created my soul and You take it back. Unto You is its death and its life. If You give it life then protect it, and if You cause it to die then forgive it. O Allah, I ask You for strength."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
                            "duration": 10000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_104.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_104.mp3",
                            "verse_no": 104,
                            "verse_text": "O Allah, save me from Your punishment on the Day that You resurrect Your slaves. (Three times)(When the Prophet saw wanted to lie down to sleep, he used to place his right hand under his cheek and says this dua'.)"
                        },
                        {
                            "arabic_text": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
                            "duration": 8000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_105.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_105.mp3",
                            "verse_no": 105,
                            "verse_text": "In Your Name, O Allah, I die and I live."
                        },
                        {
                            "arabic_text": "(1)سُبْحَانَ اللَّهِ(2)والْحَمْدُ للَّهِ(3)وَاللَّهُ أَكْبَرُ",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_106.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_106.mp3",
                            "verse_no": 106,
                            "verse_text": "Glory is to Allah. (Thirty-three times)(1)praise is to Allah. (Thirty-three times)(2)Allah is the Most Great. (Thirty-four times)(3)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ، وَالْإِنجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أّنْتَ آخِذٌ بِنَاصِيَتهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اِقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ",
                            "duration": 95000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_107.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_107.mp3",
                            "verse_no": 107,
                            "verse_text": "O Allah! Lord of the Seven heavens and Lord of the Magnificent Throne. Our Lord and the Lord of everything. Splitter of the grain and the date-stone, Revealer of the Torah and the Injeel and the Furqan (the Qur'an), I seek refuge in You from the evil of everything that You shall seize by the forelock. O Allah You are the First and nothing has come before you, and You are the Last, and nothing may come after You. You are the Most High, nothing is above You and You are the Most Near and nothing is nearer than You. Remove our debts from us and enrich us against poverty."
                        },
                        {
                            "arabic_text": "الْحَمْدُ للّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْويَ",
                            "duration": 23000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_108.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_108.mp3",
                            "verse_no": 108,
                            "verse_text": "Praise is to Allah Who has provided us with food and with drink, sufficed us and gave us an abode for how many are there with no provision and no home."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاواتِ والْأَرْضَ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
                            "duration": 44000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_109.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_109.mp3",
                            "verse_no": 109,
                            "verse_text": "O Allah, Knower of the unseen and the evident, Maker of the heavens and the earth, Lord of everything and its Master, I bear witness that there is none worthy of worship but You. I seek refuge in You from the evil of my soul and from the evil of Satan and his helpers. (I seek refuge in You) from bringing evil upon my soul and from harming any Muslim."
                        },
                        {
                            "arabic_text": "يقرأ الم تنزيل السجدة وتبارك الذي بيده الملك",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_110.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_110.mp3",
                            "verse_no": 110,
                            "verse_text": "Recite Surah 32 (As-Sajdah) and Surah 67 (Al-Mulk)."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
                            "duration": 59000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_28_111.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_111.mp3",
                            "verse_no": 111,
                            "verse_text": "O Allah, I submit myself to You, entrust my affairs to You, turn my face to You, and lay myself down depending upon You, hoping in You and fearing You. There is no refuge, and no escape, except to You. I believe in Your Book (the Qur'an) that You revealed, and the Prophet whom You sent.(Before you go to bed perform ablutions as you would for prayer, then lie down on your right side and says this dua'. Whoever says this and dies in his sleep, has died in a state of the natural monotheism (Fitrah).)"
                        }
                    ]
                },
                {
                    "chapter_name": "When turning over during the night",
                    "chapter_no": 29,
                    "verses": [
                        {
                            "arabic_text": "لَا إِلَهَ إِلَّا اللَّهُ الْوَاحِدُ الْقَهَّارُ، رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيزُ الْغَفَّارُ",
                            "duration": 23000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_29_112.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_112.mp3",
                            "verse_no": 112,
                            "verse_text": "There is none worthy of worship but Allah, the One, the Victorious, Lord of the heavens and the earth and all that is between them, the All-Mighty, the All-Forgiving. (This is to be said if you turn over in bed during the night.)"
                        }
                    ]
                },
                {
                    "chapter_name": "Upon experience unrest, fear, apprehensiveness during sleep",
                    "chapter_no": 30,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ",
                            "duration": 28000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_30_113.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_113.mp3",
                            "verse_no": 113,
                            "verse_text": "I seek refuge in the Perfect Words of Allah from His anger and His punishment, from the evil of His slaves and from the taunts of devils and from their presence."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon seeing a good or bad dream",
                    "chapter_no": 31,
                    "verses": [
                        {
                            "arabic_text": "ينفث عن يساره ، ثلاثا",
                            "duration": 4000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_31_114.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_114.mp3",
                            "verse_no": 114,
                            "verse_text": "1. Spit to your left. (Three times)2. Seek refuge in Allah from the Devil and from the evil of what you have seen. (Three times)3. Do not speak about it to anyone.4. Turn over on your other side."
                        },
                        {
                            "arabic_text": "يقوم يصلي إن أراد ذلك",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_31_115.jpeg",
                            "verse_no": 115,
                            "verse_text": "5. Get up and pray if you desire to do so."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Home & Family",
            "category_no": 2,
            "icon" : "assets/icon/praying.png",
            "chapter_count": 14,
            "chapters": [
                {
                    "chapter_name": "When wearing a garment",
                    "chapter_no": 2,
                    "verses": [
                        {
                            "arabic_text": "الْحَمْدُ لِلّهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَـيـْرِ حَوْلٍ مِنِّي وَلَا قُـوَّةٍ",
                            "duration": 16000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_2_5.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_005.mp3",
                            "verse_no": 5,
                            "verse_text": "Praise is to Allah Who has clothed me with this (garment) and provided it for me, though I was powerless myself and incapable"
                        }
                    ]
                },
                {
                    "chapter_name": "When wearing a new garment",
                    "chapter_no": 3,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُـمَّ لَـكَ الْحَـمْـدُ أَنْـتَ كَسَـوْتَنِيهِ، أََسْأََلُـكَ مِنْ خَـيْرِهِ وَخَـيْرِ مَا صُنِعَ لَـهُ، وَأَعُوذُ بِكَ مِنْ شَـرِّهِ وَشَـرِّ مَـا صُنِعَ لَـهُ",
                            "duration": 19000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_3_6.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_006.mp3",
                            "verse_no": 6,
                            "verse_text": "O Allah, praise is to You. You have clothed me. I ask You for its goodness and the goodness of what it has been made for, and I seek Your protection from the evil of it and the evil of what it has been made for."
                        }
                    ]
                },
                {
                    "chapter_name": "To someone wearing a new garment",
                    "chapter_no": 4,
                    "verses": [
                        {
                            "arabic_text": "تُبْـلِي وَيُـخْلِفُ اللّهُ تَعَالَى",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_4_7.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_007.mp3",
                            "verse_no": 7,
                            "verse_text": "May Allah replace it when it is worn out."
                        },
                        {
                            "arabic_text": "اِلْبَـسْ جَدِيـداً وَعِـشْ حَمِـيداً وَمُـتْ شَهِيداً",
                            "duration": 8000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_4_8.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_008.mp3",
                            "verse_no": 8,
                            "verse_text": "Put on new clothes, live a praise-worthy life and die as a martyr."
                        }
                    ]
                },
                {
                    "chapter_name": "Before undressing",
                    "chapter_no": 5,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِ اللَّهِ",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_5_9.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_009.mp3",
                            "verse_no": 9,
                            "verse_text": "In the Name of Allah."
                        }
                    ]
                },
                {
                    "chapter_name": "Before entering the toilet",
                    "chapter_no": 6,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِ اللَّهِ. اللَّهُـمَّ إِنِّي أَعُـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبَائِثِ",
                            "duration": 14000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_6_10.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_010.mp3",
                            "verse_no": 10,
                            "verse_text": "In the Name of Allah. O Allah, I seek protection in You from the male and female unclean spirits."
                        }
                    ]
                },
                {
                    "chapter_name": "After leaving the toilet",
                    "chapter_no": 7,
                    "verses": [
                        {
                            "arabic_text": "غُفْرَانَكَ",
                            "duration": 3000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_7_11.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_011.mp3",
                            "verse_no": 11,
                            "verse_text": "I seek Your forgiveness."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon leaving the home",
                    "chapter_no": 10,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِ اللَّهِ تَوَكَّلْـتُ عَلَى اللَّهِ، وَلاَ حَوْلَ وَلاَ قُـوَّةَ إِلاَّ بِاللَّهِ",
                            "duration": 19000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_10_16.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_016.mp3",
                            "verse_no": 16,
                            "verse_text": "In the Name of Allah, I have placed my trust in Allah, there is no might and no power except by Allah."
                        },
                        {
                            "arabic_text": "اَللَّهُـمَّ إِنِّي أَعُـوذُ بِكَ أَنْ أَضِـلَّ أَوْ أُضَـلَّ، أَوْ أَزِلَّ أَوْ أُزَلَّ، أَوْ أَظْلِـمَ أَوْ أَُظْلَـمَ، أَوْ أَجْهَلَ أَوْ يُـجْهَلَ عَلَـيَّ",
                            "duration": 19000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_10_17.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_017.mp3",
                            "verse_no": 17,
                            "verse_text": "O Allah, I seek refuge in You lest I misguide others, or I am misguided by others, lest I cause others to err or I am caused to err, lest I abuse others or be abused, and lest I behave foolishly or meet with the foolishness of others."
                        }
                    ]
                },
                {
                    "chapter_name": "When entering the home",
                    "chapter_no": 11,
                    "verses": [
                        {
                            "arabic_text": "بِسْـمِ اللّهِ وَلَجْنـَا، وَبِسْـمِ اللّهِ خَـرَجْنـَا، وَعَلَـى رَبِّنـَا تَوَكّلْـنَا",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_11_18.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_018.mp3",
                            "verse_no": 18,
                            "verse_text": "In the Name of Allah we enter, in the Name of Allah we leave, and upon our Lord we depend.(One should mention the Name of Allah when entering the home and when beginning to eat; and that the devil, hearing this, says: “there is no shelter for us here tonight and no food”.)"
                        }
                    ]
                },
                {
                    "chapter_name": "For expelling the devil and his whisperings",
                    "chapter_no": 45,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_45_141.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_141.mp3",
                            "verse_no": 141,
                            "verse_text": "I seek refuge in Allah from Satan the outcast"
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_45_142.jpeg",
                            "verse_no": 142,
                            "verse_text": "The azan (Call to prayer)"
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_45_143.jpeg",
                            "verse_no": 143,
                            "verse_text": "Recitation of the authentic zikr (remembrance of Allah) and the Qur'an. The Devil is driven out by the invocations for morning and evening, zikr before sleeping and upon waking up, zikr for entering and leaving the house, including those for entering and leaving the mosque, and by many other authentic invocations taught to us by the Prophet (SAW) such as the reading of 'Ayatul-Kursi (Al-Baqarah 2:255), and the last two 'ayat of Surat Al-Baqarah and zikr no. 93 100 times, it will be a protection for him from the Devil throughout the day. Also call to prayer (athan)."
                        }
                    ]
                },
                {
                    "chapter_name": "To the newlywed",
                    "chapter_no": 79,
                    "verses": [
                        {
                            "arabic_text": "بَارَكَ اللَّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
                            "duration": 12000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_79_190.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_190.mp3",
                            "verse_no": 190,
                            "verse_text": "May Allah bless you, and shower His blessings upon you, and join you together in goodness."
                        }
                    ]
                },
                {
                    "chapter_name": "Before sexual intercourse",
                    "chapter_no": 81,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِاللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْـتَنَا",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_81_192.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_192.mp3",
                            "verse_no": 192,
                            "verse_text": "With the Name of Allah. O Allah, keep the Devil away from us and keep the Devil away from that which You provide for us."
                        }
                    ]
                },
                {
                    "chapter_name": "When in fear of afflicting something or someone with one’s eye",
                    "chapter_no": 125,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ بَارِك عَلَيه",
                            "duration": 7000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_125_244.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_244.mp3",
                            "verse_no": 244,
                            "verse_text": "If you see anything of your brother that pleases you, or of his person or of his property (then ask Allah to bless him in it) for the envious eye is real."
                        }
                    ]
                },
                {
                    "chapter_name": "To ward off the deception of the obstinate devils",
                    "chapter_no": 128,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ ولَا فَاجِرٌ مِنْ شّرِّ مَا خَلقَ، وبَرَأَ وَذَرَأَ، ومِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وِمنْ شَرِّ مَا يَعْرُجُ فِيهَا، ومِنْ شَرِّ مَا ذَرَأَ فِي الأَرْضِ، ومِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وِمنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، ومِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بْخَيْرٍ يَا رَحْمَنُ",
                            "duration": 65000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_128_247.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_247.mp3",
                            "verse_no": 247,
                            "verse_text": "I seek refuge in the Perfect Words of Allah - which neither the upright nor the corrupt may overcome - from the evil of what He created, of what He made, and of what He scattered, from the evil of what descends from the heavens, and of what rises up to them, from the evil of what He scattered in the earth and of what emerges from it, from the evil trials of night and day, and from the evil of every night visitor, except the night visitor who comes with good. O Merciful One."
                        }
                    ]
                },
                {
                    "chapter_name": "General and beneficent rules",
                    "chapter_no": 132,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_132_267.jpeg",
                            "verse_no": 267,
                            "verse_text": "When evening descends, bring your children indoors for the devils scatter out at this hour. Then after the passing of an hour (the first hour) of the night, (you may) let them (the children) go. Close your doors while mentioning the Name of Allah, for the devil may not open a closed door. Fasten your waterskins mentioning the Name of Allah. Cover your eating vessels mentioning the Name of Allah even if you just put something over it, and extinguish your lamps."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Food & Drink",
            "category_no": 3,
            "chapter_count": 7,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "Upon breaking fast",
                    "chapter_no": 68,
                    "verses": [
                        {
                            "arabic_text": "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ، وَثَبَتَ الأَجْرُ إِنْ شَاءَ اللَّهُ",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_68_176.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_176.mp3",
                            "verse_no": 176,
                            "verse_text": "The thirst is gone, the veins are moistened and the reward is confirmed, if Allah wills."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلِّ شَيْءٍ، أَنْ تَغْفِرَ لِي",
                            "duration": 16000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_68_177.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_177.mp3",
                            "verse_no": 177,
                            "verse_text": "O Allah, I ask You by Your mercy, which encompasses all things, that You forgive me."
                        }
                    ]
                },
                {
                    "chapter_name": "Before eating",
                    "chapter_no": 69,
                    "verses": [
                        {
                            "arabic_text": "(1)ِبِسْمِ اللَّه(2)بِسْمِ اللَّهِ فِي أَوَّلِهِ وَآخِرِه",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_69_178.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_178.mp3",
                            "verse_no": 178,
                            "verse_text": "With the Name of Allah.(1)(If you forgot) With the Name of Allah, in the beginning and in the end.(2)"
                        },
                        {
                            "arabic_text": "(1)اللَّهُمَّ بَارِكْ لَنَا فيهِ وَأَطْعِمْنَا خَيْراً مِنْهُ(2)اللّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ",
                            "duration": 17000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_69_179.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_179.mp3",
                            "verse_no": 179,
                            "verse_text": "Whomever Allah has given food, should say: \"O Allah, bless us in it and provide us with better than it\".(1)Whomever Allah has given milk to drink, should say: \"O Allah, bless us in it and give us more of it\".(2)"
                        }
                    ]
                },
                {
                    "chapter_name": "Upon completing the meal",
                    "chapter_no": 70,
                    "verses": [
                        {
                            "arabic_text": "الْحَمْدُ للَّهِ الَّذِي أَطْعَمَنِي هَذَا، وَرَزَقَنِيهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
                            "duration": 14000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_70_180.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_180.mp3",
                            "verse_no": 180,
                            "verse_text": "Praise is to Allah Who has given me this food and sustained me with it though I was unable to do it and powerless."
                        },
                        {
                            "arabic_text": "الْحَمْدُ للَّهِ حَمْداً كَثِيراً طَيِّباً مُبارَكاً فِيهِ، غَيْرَ مَكْفِيٍّ وَلِا مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبَّنَا",
                            "duration": 20000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_70_181.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_181.mp3",
                            "verse_no": 181,
                            "verse_text": "All praise is to Allah, praise in abundance, good and blessed. It cannot (be compensated for, nor can it) be left, nor can it be done without, our Lord."
                        }
                    ]
                },
                {
                    "chapter_name": "Of the guest for the host",
                    "chapter_no": 71,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ بَارِكْ لَهُمْ فِيمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_71_182.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_182.mp3",
                            "verse_no": 182,
                            "verse_text": "O Allah, bless them in what You have provided for them, and forgive them and have mercy on them."
                        }
                    ]
                },
                {
                    "chapter_name": "To one offering a drink or to one who intended to do that",
                    "chapter_no": 72,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي",
                            "duration": 10000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_72_183.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_183.mp3",
                            "verse_no": 183,
                            "verse_text": "O Allah, feed the one who has fed me and drink to the one who has given me drink."
                        }
                    ]
                },
                {
                    "chapter_name": "When breaking fast in someone’s home",
                    "chapter_no": 73,
                    "verses": [
                        {
                            "arabic_text": "أَفْطَرَ عِنْدَكُمْ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الَأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ الْمَلاَئِكَةُ",
                            "duration": 22000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_73_184.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_184.mp3",
                            "verse_no": 184,
                            "verse_text": "With you, those who are fasting have broken their fast, you have fed those who are righteous, and the angels recite their prayers upon you."
                        }
                    ]
                },
                {
                    "chapter_name": "By one fasting when presented with food and does not break his fast",
                    "chapter_no": 74,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_74_185.jpeg",
                            "verse_no": 185,
                            "verse_text": "When you are invited (to eat) then reply to the invitation. If you are fasting then invoke Allah's blessings (on your host), and if you are not fasting then eat."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Joy & Distress",
            "category_no": 4,
            "chapter_count": 15,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "For anxiety and sorrow",
                    "chapter_no": 34,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْـدِكَ، ابْنُ أَمَتِـكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِـكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْـدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وجَلَاءَ حُزْنِي وذَهَابَ هَمِّي",
                            "duration": 66000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_34_120.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_120.mp3",
                            "verse_no": 120,
                            "verse_text": "O Allah, I am Your slave and the son of Your male slave and the son of your female slave. My forehead is in Your Hand (i.e. You have control over me). Your Judgment upon me is assured and Your Decree concerning me is just. I ask You by every Name that You have named Yourself with, revealed in Your Book, taught any one of Your creation or kept unto Yourself in the knowledge of the unseen that is with You, to make the Qur'an the spring of my heart, and the light of my chest, the banisher of my sadness and the reliever of my distress."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَعْوذُ بِكَ مِنَ الهَمِّ وَ الْحَزَنِ، وَالعَجْزِ وَالْكَسَلِ، والبُخْلِ والْجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ",
                            "duration": 23000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_34_121.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_121.mp3",
                            "verse_no": 121,
                            "verse_text": "O Allah, I seek refuge in you from grief and sadness, from weakness and from laziness, from miserliness and from cowardice, from being overcome by debt and overpowered by men."
                        }
                    ]
                },
                {
                    "chapter_name": "For one in distress",
                    "chapter_no": 35,
                    "verses": [
                        {
                            "arabic_text": "لَا إلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمْ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ العَرْشِ العَظِيمُ، لَا إِلَهَ إِلَّا اللَّهْ رَبُّ السَّمَوَاتِ وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الْكَرِيمُ",
                            "duration": 34000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_35_122.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_122.mp3",
                            "verse_no": 122,
                            "verse_text": "There is none worthy of worship but Allah the Mighty, the Forbearing. There is none worthy of worship but Allah, Lord of the Magnificent Throne. There is none worthy of worship but Allah, Lord of the heavens and Lord of the earth, and Lord of the Noble Throne."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ رَحْمَتَكَ أَرْجُوفَلَا تَكِلْنِي إِلىَ نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أَنْتَ",
                            "duration": 25000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_35_123.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_123.mp3",
                            "verse_no": 123,
                            "verse_text": "O Allah, I hope for Your mercy. Do not leave me to myself even for the blinking of an eye. Correct all of my affairs for me. There is none worthy of worship but You."
                        },
                        {
                            "arabic_text": "لَا إِلَهَ إِلَّا أَنْت سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
                            "duration": 14000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_35_124.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_124.mp3",
                            "verse_no": 124,
                            "verse_text": "There is none worthy of worship but You, glory is to You. Surely, I was among the wrong doers."
                        },
                        {
                            "arabic_text": "اللَّهُ اللَّهُ رَبِّ لَا أُشْرِكُ بِهِ شَيْئاً",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_35_125.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_125.mp3",
                            "verse_no": 125,
                            "verse_text": "Allah, Allah is my Lord. I do not associate anything with Him."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon encountering an enemy or those of authority",
                    "chapter_no": 36,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_36_126.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_126.mp3",
                            "verse_no": 126,
                            "verse_text": "O Allah, we ask You to restrain them by their necks and we seek refuge in You from their evil."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ أَنْتَ عَضُدي، وَأَنْتَ نَصِيرِي، بِكَ أَحُولُ وَبِكَ أَصُولُ وَبِكَ أُقَاتِلُ",
                            "duration": 17000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_36_127.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_127.mp3",
                            "verse_no": 127,
                            "verse_text": "O Allah, You are my strength and You are my support. For Your sake I go forth and for Your sake I advance and for Your sake I fight."
                        },
                        {
                            "arabic_text": "حَسْبُنَا اللَّهُ وَنِعْمَ الوَكِيلُ",
                            "duration": 8000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_36_128.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_128.mp3",
                            "verse_no": 128,
                            "verse_text": "Allah is sufficient for us and the best of those on whom to depend."
                        }
                    ]
                },
                {
                    "chapter_name": "Invocation against the oppression of rulers",
                    "chapter_no": 37,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، كُنْ لِي جَاراً مِنْ (اِسمُه) وَأَحْزَابِهِ مِنْ خَلاَئِقِكَ، أَن يَفْرُطَ عَلَيَّ أَحَدٌ مِنْهُمْ أَوْ يَطْغَى، عَزَّ جَارُكَ وَجَلَّ ثَنَائُكَ، وَلَا إِلَهَ إِلَّا أَنْتَ",
                            "duration": 47000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_37_129.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_129.mp3",
                            "verse_no": 129,
                            "verse_text": "O Allah, Lord of the Seven heavens, Lord of the Magnificent Throne, be for me a support against (say the person's name) and his helpers from among your creatures, lest any of them abuse me or do me wrong. Mighty is Your patronage and glorious are Your praises. There is none worthy of worship but You."
                        },
                        {
                            "arabic_text": "اللَّهُ أَكْبَرُ، اللَّهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيعًا، اللَّهُ أَعَزُّ مِمَّا أَخَافُ وَ أَحْذَرُ، أَعُوذُ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ، الْمُمْسِكِ السَّمَاوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضَ إِلاَّ بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ (اِسمُه)، وَجُنُودِهِ وَأَتْبَاعِهِ وَأَشْيَاعِهِ، مِنَ الْجِنِّ وَالإِنْسِ، اللَّهُمَّ كُنُ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُكَ وَعَزَّ جَارُكَ، وَتَبَارَكَ اسْمُكَ، وَلاَ إِلَهَ غَيْرُكَ",
                            "duration": 69000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_37_130.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_130.mp3",
                            "verse_no": 130,
                            "verse_text": "Allah is the Most Great, Mightier than all His creation. He is Mightier than what I fear and dread. I seek refuge in Allah, Who there is none worthy of worship but Him. He is the One Who holds the Seven heavens from falling upon the earth except by His command. (I seek refuge in You Allah) from the evil of Your slave (say the person's name), and his helpers, his followers and his supporters from among the jinn and mankind. O Allah, be my support against their evil. Glorious are Your praises and mighty is Your patronage. Blessed is Your Name, there is no true God but You. (Three times)"
                        }
                    ]
                },
                {
                    "chapter_name": "Against enemies",
                    "chapter_no": 38,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيعَ الْحِسَابِ، اهْزِمِ الأَحْزَابَ، اللَّهُمَّ اهْزِ مْهُمْ وَزَلْزِلْهُمْ",
                            "duration": 27000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_38_131.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_131.mp3",
                            "verse_no": 131,
                            "verse_text": "Allah, Revealer of the Book, Swift to account, defeat the groups (of disbelievers). O Allah, defeat them and shake them."
                        }
                    ]
                },
                {
                    "chapter_name": "When being afraid of a group of people",
                    "chapter_no": 39,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ اكْفِنِيهِمْ بِمَا شِئْتَ",
                            "duration": 8000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_39_132.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_132.mp3",
                            "verse_no": 132,
                            "verse_text": "O Allah, suffice me against them however You wish."
                        }
                    ]
                },
                {
                    "chapter_name": "For one afflicted with doubt in his faith",
                    "chapter_no": 40,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْـطَانِ الرَّجِيـمِ",
                            "duration": 10000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_40_133.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_133.mp3",
                            "verse_no": 133,
                            "verse_text": "I seek refuge in Allah from satan the outcast (then you should desist from doing what you are in doubt about)."
                        },
                        {
                            "arabic_text": "آمَنْـتُ بِاللَّهِ وَرُسُـلِهِ",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_40_134.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_134.mp3",
                            "verse_no": 134,
                            "verse_text": "I believe in Allah and His Messenger."
                        },
                        {
                            "arabic_text": "هُوَ الأَوَّلُ وَالآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيءٍ عَلِيمٌ",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_40_135.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_135.mp3",
                            "verse_no": 135,
                            "verse_text": "He is the First and the Last, the Most High and the Most Near. And He is the Knower of all things"
                        }
                    ]
                },
                {
                    "chapter_name": "Settling a debt",
                    "chapter_no": 41,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكِ عَمَّنْ سِوَاكَ",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_41_136.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_136.mp3",
                            "verse_no": 136,
                            "verse_text": "O Allah, suffice me with what You have allowed instead of what You have forbidden, and make me independent of all others besides You."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَعْوذُ بِكَ مِنَ الهَمِّ وَالْحَزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلْعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ",
                            "duration": 23000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_41_137.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_137.mp3",
                            "verse_no": 137,
                            "verse_text": "O Allah, I seek refuge in You from grief and sadness, from weakness and from laziness, from miserliness and from cowardice, from being overcome by debt and from being overpowered by men"
                        }
                    ]
                },
                {
                    "chapter_name": "For one afflicted by a calamity",
                    "chapter_no": 53,
                    "verses": [
                        {
                            "arabic_text": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي، وَأَخْلِفْ لِي خَيْراً مِنْهَا",
                            "duration": 26000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_53_154.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_154.mp3",
                            "verse_no": 154,
                            "verse_text": "We are from Allah and unto Him we return. O Allah take me out of my plight and bring to me after it something better."
                        }
                    ]
                },
                {
                    "chapter_name": "For fear of shirk",
                    "chapter_no": 92,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَعُوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنا أَعْلَمْ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_92_203.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_203.mp3",
                            "verse_no": 203,
                            "verse_text": "O Allah, I seek refuge in You lest I associate anything with You knowingly, and I seek Your forgiveness for what I know not."
                        }
                    ]
                },
                {
                    "chapter_name": "Forbiddance of ascribing things to omens",
                    "chapter_no": 94,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ لَا طَيْرَ إِلَاَّ طَيْرُكَ، وَلَا خَيْرَ إِلَاَّ خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_94_205.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_205.mp3",
                            "verse_no": 205,
                            "verse_text": "O Allah there is no portent other than Your portent, no goodness other than Your goodness, and none\n worthy of worship other than You."
                        }
                    ]
                },
                {
                    "chapter_name": "What to say upon receiving pleasing or displeasing news",
                    "chapter_no": 106,
                    "verses": [
                        {
                            "arabic_text": "(1)الْحَمْدُ للَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ(2)الْحَمْدُ للَّهِ عَلَى كُلِّ حَالٍ",
                            "duration": 17000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_106_218.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_218.mp3",
                            "verse_no": 218,
                            "verse_text": "When something happened that pleased him say: \"Praise is to Allah Who by His blessings all good things are perfected\".(1)And if something happened that displeased him say: \"Praise is to Allah in all circumstances\".(2)"
                        }
                    ]
                },
                {
                    "chapter_name": "At times of amazement and delight",
                    "chapter_no": 122,
                    "verses": [
                        {
                            "arabic_text": "سُبْحَانَاللَّهِ",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_122_240.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_240.mp3",
                            "verse_no": 240,
                            "verse_text": "Glory is to Allah."
                        },
                        {
                            "arabic_text": "اللَّهُ أَكْبَرُ",
                            "duration": 3000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_122_241.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_241.mp3",
                            "verse_no": 241,
                            "verse_text": "Allah is the Most Great."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon receiving pleasant news",
                    "chapter_no": 123,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_123_242.jpeg",
                            "verse_no": 242,
                            "verse_text": "Whenever something happened that pleased him or made him happy, the Prophet would prostrate himself in gratitude to Allah, the Blessed, the All-Mighty."
                        }
                    ]
                },
                {
                    "chapter_name": "When startled",
                    "chapter_no": 126,
                    "verses": [
                        {
                            "arabic_text": "لَا إِلهَ إِلاَّ اللَّهُ",
                            "duration": 8000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_126_245.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_245.mp3",
                            "verse_no": 245,
                            "verse_text": "There is none worthy of worship but Allah."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Travel",
            "category_no": 5,
            "chapter_count": 11,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "When mounting an animal or any means of transport",
                    "chapter_no": 95,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِ اللَّهِ وَالْحَمْدُ لِلَّهِ، سُبْحَانَ الَّذِي سَخَّرَ لَناَ هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ، الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، اللَّهُ أكْبَرُ، اللَّهُ أكْبَرُ، اللَّهُ أكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَاَّ أَنْتَ",
                            "duration": 67000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_95_206.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_206.mp3",
                            "verse_no": 206,
                            "verse_text": "With the Name of Allah. Praise is to Allah. Glory is to Him Who has provided this for us though we could never have had it by our efforts. Surely, unto our Lord we are returning. Praise is to Allah. Praise is to Allah. Praise is to Allah. Allah is the Most Great. Allah is the Most Great. Allah is the Most Great. Glory is to You. O Allah, I have wronged my own soul. Forgive me, for surely none forgives sins but You."
                        }
                    ]
                },
                {
                    "chapter_name": "For travel",
                    "chapter_no": 96,
                    "verses": [
                        {
                            "arabic_text": "(1)اللَّهُ أكبَرُ، اللَّهُ أكبَرُ، اللَّهُ أكبَرُ، سُـبْحانَ الَّذِي سَخَّـرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْـرِنيِنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبونَ، اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّـقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمالِ وَالأَهْلِ(2) آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
                            "duration": 105000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_96_207.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_207.mp3",
                            "verse_no": 207,
                            "verse_text": "Allah is the Most Great. Allah is the Most Great. Allah is the Most Great. Glory is to Him Who has provided this for us though we could never have had it by our efforts. Surely, unto our Lord we are returning. O Allah, we ask You on this our journey for goodness and piety, and for works that are pleasing to You. O Allah , lighten this journey for us and make its distance easy for us. O Allah, You are our Companion on the road and the One in Whose care we leave our family. O Allah, I seek refuge in You from this journey's hardships, and from the wicked sights in store and from finding our family and property in misfortune upon returning.(1)Upon returning recite the same and adding: \"We return repentant to our Lord, worshiping our Lord, and praising our Lord\".(2)"
                        }
                    ]
                },
                {
                    "chapter_name": "Upon entering a town or village",
                    "chapter_no": 97,
                    "verses": [
                        {
                            "arabic_text": "أللًّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرَاضِينَ السَّبْعِ وَما أَقْلَلْنَ، وَرَبَّ الشَّيَاطِينِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيهَا",
                            "duration": 44000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_97_208.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_208.mp3",
                            "verse_no": 208,
                            "verse_text": "O Allah, Lord of the Seven heavens and all they overshadow, Lord of the Seven worlds and all they uphold, Lord of the devils and all they lead astray, Lord of the winds and all they scatter. I ask You for the goodness of this town and for the goodness of its people, and for the goodness it contains. I seek refuge in You from its evil, from the evil of its people and from the evil it contains."
                        }
                    ]
                },
                {
                    "chapter_name": "When entering the market",
                    "chapter_no": 98,
                    "verses": [
                        {
                            "arabic_text": "لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لهُ، لَهُ الْمُلْكُ وَلهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                            "duration": 28000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_98_209.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_209.mp3",
                            "verse_no": 209,
                            "verse_text": "None has the right to be worshiped but Allah alone, Who has no partner. His is the dominion and His is the praise. He brings life and He causes death, and He is living and does not die. In His Hand is all good, and He is Able to do all things."
                        }
                    ]
                },
                {
                    "chapter_name": "When the mounted animal (or mean of transport) stumbles",
                    "chapter_no": 99,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِ اللَّهِ",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_99_210.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_210.mp3",
                            "verse_no": 210,
                            "verse_text": "With the Name of Allah."
                        }
                    ]
                },
                {
                    "chapter_name": "Supplication of the traveller for the resident",
                    "chapter_no": 100,
                    "verses": [
                        {
                            "arabic_text": "أَسْتَوْدِعُكُمُ اللَّهَ الَّذِي لَا تَضِيعُ وَدَائِعُهُ",
                            "duration": 7000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_100_211.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_211.mp3",
                            "verse_no": 211,
                            "verse_text": "I leave you in the care of Allah, as nothing is lost that is in His care."
                        }
                    ]
                },
                {
                    "chapter_name": "Supplication of the resident for the traveller",
                    "chapter_no": 101,
                    "verses": [
                        {
                            "arabic_text": "أَسْتَوْدِعُ اللَّهَ دِينَكَ، وَأَمَانَتَكَ، وَخَوَاتِيمَ عَمَلِكَ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_101_212.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_212.mp3",
                            "verse_no": 212,
                            "verse_text": "I leave your religion in the care of Allah, as well as your safety, and the last of your deeds."
                        },
                        {
                            "arabic_text": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَذَنْبَكَ، وَيَسَّرَ لَكَ الْخَيْرَ حَيْثُمَا كُنْتَ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_101_213.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_213.mp3",
                            "verse_no": 213,
                            "verse_text": "May Allah give you piety as your provision, forgive your sins, and make goodness easy for you wherever you are."
                        }
                    ]
                },
                {
                    "chapter_name": "Remembrance while ascending or descending",
                    "chapter_no": 102,
                    "verses": [
                        {
                            "arabic_text": "(1)اللَّهُ أَكْبَرُ(2)سُبْحَانَاللَّهِ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_102_214.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_214.mp3",
                            "verse_no": 214,
                            "verse_text": "Jabir (RA), said: \"Whenever we went up a hill we would say: \"Allah is the Most Great\".(1)and when we descended we would say: \"Glory is to Allah\".(2)"
                        }
                    ]
                },
                {
                    "chapter_name": "Prayer of the traveller as dawn approaches",
                    "chapter_no": 103,
                    "verses": [
                        {
                            "arabic_text": "سَمِعَ سَامِعٌُ بِحَمْدِ اللَّهِ، وَحُسْنِ بَلَائِهِ عَلَيْنَا. رَبَّنَا صَاحِبْنَا وَأَفْضِلْ عَلَيْنَا عَائِذاً بِاللَّهِ مِنَ النَّارِ",
                            "duration": 24000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_103_215.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_215.mp3",
                            "verse_no": 215,
                            "verse_text": "He Who listens has heard that we praise Allah for the good things He gives us. Our Lord, be with us and bestow Your favor upon us. I seek the protection of Allah from the Fire."
                        }
                    ]
                },
                {
                    "chapter_name": "Stopping or lodging somewhere",
                    "chapter_no": 104,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_104_216.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_216.mp3",
                            "verse_no": 216,
                            "verse_text": "I seek refuge in the Perfect Words of Allah from the evil of what He has created."
                        }
                    ]
                },
                {
                    "chapter_name": "While returning from travel",
                    "chapter_no": 105,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُ أَكْبَرُ، اللَّهُ أَكْـبَرُ، اللَّهُ أَكْـبَرُ. لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ تاَئِبُونَ عَابِدُونَ، لِرَبِّنَا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأَحْزَابَ وَحْدَهُ",
                            "duration": 57000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_105_217.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_217.mp3",
                            "verse_no": 217,
                            "verse_text": "(Allah the Great, Allah the Great, Allah the Great.) None has the right to be worshiped but Allah alone, Who has no partner. His is the dominion and His is the praise, and He is Able to do all things. We return repentant to our Lord, worshiping our Lord, and praising our Lord. He fulfilled His Promise, He aided His slave, and He alone defeated the Confederates."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Prayer",
            "category_no": 6,
            "chapter_count": 19,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "When starting ablution",
                    "chapter_no": 8,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِ اللّهِ",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_8_12.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_012.mp3",
                            "verse_no": 12,
                            "verse_text": "In the Name of Allah"
                        }
                    ]
                },
                {
                    "chapter_name": "Upon completing the ablution",
                    "chapter_no": 9,
                    "verses": [
                        {
                            "arabic_text": "أَشْهَدُ أَنْ لَا إِلَـهَ إِلاَّ اللّهُ وَحْدَهُ لَا شَريـكَ لَـهُ وَأَشْهَدُ أَنَّ مُحَمَّـداً عَبْـدُهُ وَرَسُـولُـهُ",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_9_13.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_013.mp3",
                            "verse_no": 13,
                            "verse_text": "I bear witness that none has the right to be worshiped but Allah alone, Who has no partner; and I bear witness that Muhammad is His slave and His Messenger."
                        },
                        {
                            "arabic_text": "اَللَّهُـمَّ اجْعَلْنِـي مِنَ التَّـوَّابِينَ وَاجْعَـلْنِي مِنَ الْمُتَطَهِّـرِينَ",
                            "duration": 12000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_9_14.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_014.mp3",
                            "verse_no": 14,
                            "verse_text": "O Allah, make me among those who turn to You in repentance, and make me among those who are purified."
                        },
                        {
                            "arabic_text": "سُبْحـَانَكَ اللَّهُـمَّ وَبِحَمْدِكَ، أَشْهَـدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَـيْكَ",
                            "duration": 19000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_9_15.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_015.mp3",
                            "verse_no": 15,
                            "verse_text": "Glory is to You, O Allah, and praise. I bear witness that there is none worthy of worship but You. I seek Your forgiveness and turn to You in repentance."
                        }
                    ]
                },
                {
                    "chapter_name": "When going to the mosque",
                    "chapter_no": 12,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُـمَّ اجْعَـلْ فِي قَلْبِـي نُوراً، وَفِي لِسَـانِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِيِ نُورًا، وَمِنْ فََوْقِي نُوراً، وَ مِنْ تَحْتِي نُوراً، وَ عَنْ يَمِينِي نُوراَ، وعَنْ شِمَالِي نُوراً، وَمِنْ أَماَمِي نُوراً،,وَمِنْ خَلْفِي نُوراً، وَاجْعَلْ فِي نَفْسِي نُوراً، وأََعْظِمْ لِي نُوراً، وَعَظِِّمْ لِي نُوراً، وَاجْعَلْ لِي نُوراً، واجْعَلْنِي نُوراً، ألَلَّهُمَّ أَعْطِنِي نُوراً، وَاجْعَلْ فِي عَصَبِي نُوراً، وَفِي لَحْمِي نُوراً، وَفِي دَمِي نُوراً، وَفِي شَعْرِي نُوراً، وفِي بَشَرِي نُوراً، أَللَّهُمَّ اجِعَلْ لِي نُوراً فِي قَّبْرِي... وَ نُوراَ فِي عِظاَمِي، وَزِدْنِي نُوراً، وَزِدْنِي نُوراَ، وَزِدْنِي نُوراً، وَهَبْ لِي نُوراً عَلَى نُوراً",
                            "duration": 94000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_12_19.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_019.mp3",
                            "verse_no": 19,
                            "verse_text": "O Allah, place light in my heart, and on my tongue light, and in my ears light and in my sight light, and above me light, and below me light, and to my right light, and to my left light, and before me light and behind me light. Place in my soul light. Magnify for me light, and amplify for me light. Make for me light and make me a light. O Allah, grant me light, and place light in my nerves, and in my body light and in my blood light and in my hair light and in my skin light. O Allah, make for me a light in my grave... And a light in my bones. Increase me in light, increase me in light, increase me in light. Grant me light upon light."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon entering the mosque",
                    "chapter_no": 13,
                    "verses": [
                        {
                            "arabic_text": "أَعوذُ بِاللّهِ العَظِيـمِ، وَبِوَجْهِـهِ الكَرِيـمِ وَسُلْطـَانِه القَدِيـمِ، مِنَ الشَّيْـطَانِ الرَّجِـيمِ، بِسْـمِ اللّهِ وَالصَّلَاةُ وَالسَّلامُ عَلَى رَسُولِ اللّهِ، اَللَّهُـمَّ افْتَـحْ لِي أَبْوَابَ رَحْمَتـِكَ",
                            "duration": 37000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_13_20.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_020.mp3",
                            "verse_no": 20,
                            "verse_text": "I seek refuge in Almighty Allah, by His Noble Face, by His primordial power, from Satan the outcast. In the Name of Allah, and blessings and peace be upon the Messenger of Allah. O Allah, open before me the doors of Your mercy."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon leaving the mosque",
                    "chapter_no": 14,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِ اللّهِ وَالصَّلاَةُ وَالسَّلاَمُ عَلَى رَسُولِ اللّهِ، اَللَّهُـمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْـلِكَ، اَللَّهُـمَّ اعْصِمْنِـي مِنَ الشَّيْـطَانِ الرَّجِـيمِ",
                            "duration": 26000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_14_21.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_021.mp3",
                            "verse_no": 21,
                            "verse_text": "In the Name of Allah, and peace and blessings be upon the Messenger of Allah. O Allah, I ask for Your favor, O Allah, protect me from Satan the outcast."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon hearing the athan",
                    "chapter_no": 15,
                    "verses": [
                        {
                            "arabic_text": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّهِ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_15_22.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_022.mp3",
                            "verse_no": 22,
                            "verse_text": "Repeat what the muazzin says, except for when he says: حَيَّ عَلَى الصَّلاَةِ وَحَيَّ عَلَى الْفَلَاحِ.Here you should says: \"There is no might and no power except by Allah\"."
                        },
                        {
                            "arabic_text": "وَأَنَا أَشْـهَدُ أَنْ لَا إِلـهَ إِلاَّ اللّهُ وَحْـدَهُ لَا شَـرِيكَ لَـهُ وَأَنَّ محَمَّـداً عَبْـدُهُ وَرَسُـولُهُ، رَضِيـتُ بِاللّهِ رَبَّاً، وَبِمُحَمَّـدٍ رَسُـولاً، وَبِالإِسْلَامِ دِينـاً",
                            "duration": 28000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_15_23.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_023.mp3",
                            "verse_no": 23,
                            "verse_text": "After the muazzin says the words of affirmation of Faith (Shahadah) says: \"I bear witness that none has the right to be worshiped but Allah alone, Who has no partner, and that Muhammad is His slave and His Messenger. I am pleased with Allah as my Lord, with Muhammad as my Messenger and with Islam as my religion\"."
                        },
                        {
                            "arabic_text": "اللّهُمّ صَلّ عَلَى مُحَمّدٍ وَآلِ مُحَمّدٍ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_15_24.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_024.mp3",
                            "verse_no": 24,
                            "verse_text": "One should then send prayers on the Prophet (saws) after answering the call of the muazzin."
                        },
                        {
                            "arabic_text": "اللَّهُـمَّ رَبَّ هَذِهِ الدَّعْـوَةِ التَّـامَّةِ، وَالصَّلَاةِ القَـائِمَة، آتِ مُحَـمَّداً الوَسِيـلَةَ وَالْفَضِـيلَةَ، وَابْعَـثْهُ مَقَـامـاً مَحْـمُوداً الَّذِي وَعَـدْتَهُ، إِنَّـكَ لَا تُـخْلِفُ المِيـعَادِ",
                            "duration": 40000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_15_25.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_025.mp3",
                            "verse_no": 25,
                            "verse_text": "O Allah, Lord of this perfect call and established prayer. Grant Muhammad the intercession and favor, and raise him to the honored station You have promised him, verily You do not neglect promises."
                        },
                        {
                            "arabic_text": "يدعو لنفسه بين الأذان والإقامة فإن الدعاء حينئذ لا يرد",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_15_26.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_026.mp3",
                            "verse_no": 26,
                            "verse_text": "One should also supplicate for himself during the time between the azan and the iqamah as supplication at such time is not rejected."
                        }
                    ]
                },
                {
                    "chapter_name": "Supplication at the start of the prayer",
                    "chapter_no": 16,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُـمَّ باَعِـدْ بَيْـنِي وَبَيْنَ خَطَـاياَيَ كَماَ باَعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبْ، اللَّهُـمَّ نَقِّنِـي مِنْ خَطَاياَيَ كَمـَا يُـنَقَّى الثَّـوْبُ الأَبْيَضُ مِنَ الدَّنَسْ، اللَّهُـمَّ اغْسِلْنِـي مِنْ خَطَايـَايَ بِالثَّلـجِ وَالمـَاءِ وَالْبَرَدِ",
                            "duration": 34000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_16_27.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_027.mp3",
                            "verse_no": 27,
                            "verse_text": "O Allah, separate me from my sins as You have separated the East from the West. O Allah, cleanse me of my transgressions as the white garment is cleansed of stains. O Allah, wash away my sins with ice and water and frost."
                        },
                        {
                            "arabic_text": "سُبْـحَانَكَ اللَّهُـمَّ وَبِحَمْـدِكَ، وَتَبَارَكَ اسْمُـكَ، وَتَعـَالَى جَـدُّكَ وَلَا إِلَهَ غَيْرُكَ",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_16_28.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_028.mp3",
                            "verse_no": 28,
                            "verse_text": "Glory is to You O Allah, and praise. Blessed is Your Name and Exalted is Your Majesty. There is none worthy of worship but You."
                        },
                        {
                            "arabic_text": "وَجَّهْـتُ وَجْهِـيَ لِلَّذِي فَطَرَ السَّمـَوَاتِ وَالأَرْضَ حَنِـيفاً وَمـَا أَنَا مِنَ الْمُشْرِكِيَن، إِنَّ صَلاَتِـي، وَنُسُكِي، وَمَحْـياَيَ، وَمَمَاتِـي لِلَّهِ رَبِّ الْعَالَمِينَ، لَا شَرِيـكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِـمِينَ. اللَّهُـمَّ أَنْتَ الْمَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّـي وَأَنَا عَبْـدُكَ ، ظَلَمْـتُ نَفْسِـي وَاعْـتَرَفْتُ بِذَنْبِـي فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً إِنَّـهُ لَا يَغْـفِرُ الذُّنُوبََ إِلَاَّ أَنْتَ. وَاهْدِنِي لأَحْسَنِ الأَخْلَاقِ لاَ يَهْدِي لأَحْسَـنِهَا إِلاَّ أَنْـتَ، وَاصْـرِفْ عَـنِّي سَيِّئَهَا، لا يَصْرِفُ عَـنِّي سَيِّئَهَـا إِلاَّ أَنْـتَ، لَبَّـيْكَ وَسَعْـدَيْكَ، وَالْخَـيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْـسَ إِلَـيْكَ، أَنَا بِكَ وَإِلَيْـكَ، تَبـَارَكْتَ وَتَعَالَيتَ أَسْتَغْـفِرُكَ وَأَتُوبُ إِلَيْكَ",
                            "duration": 122000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_16_29.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_029.mp3",
                            "verse_no": 29,
                            "verse_text": "I have turned my face sincerely towards He who has brought forth the heavens and the Earth and I am not of those who associate (others with Allah). Indeed my prayer, my sacrifice, my life and my death are for Allah, Lord of the worlds, no partner has He, with this I am commanded and I am of the Muslims. O Allah, You are the Sovereign, none has the right to be worshiped except You. You are my Lord and I am Your servant, I have wronged my own soul and have acknowledged my sin, so forgive me all my sins for no one forgives sins except You. Guide me to the best of characters for none can guide to it other than You, and deliver me from the worst of characters for none can deliver me from it other than You. Here I am, in answer to Your call, happy to serve you. All good is within Your hands and evil does not stem from You. I exist by your will and will return to you. Blessed and High are You, I seek Your forgiveness and repent unto You."
                        },
                        {
                            "arabic_text": "اللَّهُـمَّ رَبَّ جِبْرَائِيلَ، وَمِيكَائِيلَ، وَإِسْرَافِيلَ، فَاطِـرَ السَّمَوَاتِ وَالأَرْضِ، عَالِـِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ. اِهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ",
                            "duration": 56000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_16_30.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_030.mp3",
                            "verse_no": 30,
                            "verse_text": "O Allah, Lord of Jibraeel, Meekaeel and Israfeel (great angles), Creator of the heavens and the Earth, Knower of the seen and the unseen. You are the arbitrator between Your servants in that which they have disputed. Guide me to the truth by Your leave, in that which they have differed, for verily You guide whom You will to a straight path."
                        },
                        {
                            "arabic_text": "(1)اللَّهُ أَكْبَرُ كَبِيرَا، اللَّهُ أَكْبَرُ كَبِيرَا، اللَّهُ أَكْبَرُ كَبِيرَا، وَالْحَمْدُ لِلَّهِ كَثِيرَا، وَالْحَمْدُ لِلَّهِ كَثِيرَا، وَالْحَمْدُ لِلَّهِ كَثِيرَا، وَسُبْحاَنَ اللَّهِ بُكْرَةً وَأَصِيلًا (2)أَعُـوذُ بِاللّهِ مِنَ الشَّـيْطَانِ: مِنْ نَفْخِهِ، وَنَفْـثِهِ، وَهَمـْزِهِ",
                            "duration": 55000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_16_31.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_031.mp3",
                            "verse_no": 31,
                            "verse_text": "Allah is the Greatest, Most Great. Allah is the Greatest, Most Great. Allah is the Greatest, Most Great. Praise is to Allah, abundantly. Praise is to Allah, abundantly. Praise is to Allah, abundantly. Glory is to Allah, at the break of day and at its end. (Three times)(1)I seek refuge in Allah from Satan. From his breath and from his voice and from his whisper.(2)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّـمَوَاتِ وَالأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ الْحَقُّ، وَوَعْـدُكَ الْحَقُّ، وَقَوْلُكَ الْحَقُّ، وَلِقَاؤُكَ الْحَقُّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالنَّبِيُّونَ حَقُّ، وَمُحَمَّدٌ حَقٌّ، وَالسَّاعَةُ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَبِكَ آمَنْـتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ، وَما أَخَّرْتُ، وَما أَسْـرَرْتُ، وَمَا أَعْلَنْتُ أَنْتَ الْمُقَـدِّمُ، وَأَنْتَ الْمُـؤَخِّرُ، لَا إِاَـهَ إِلَاّ أَنْتَ أَنْتَ إِلَهِي لَا إِاَـهَ إِلاَّ أَنْتَ",
                            "duration": 118000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_16_32.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_032.mp3",
                            "verse_no": 32,
                            "verse_text": "O Allah, praise is to You. You are the Light of the heavens and the earth and all that they contain. Praise is to You, You are the Sustainer of the heavens and the earth and all they contain. Praise is to You, You are the Lord of the heavens and the earth and all they contain. Praise is to You, Yours is dominion of the heavens and the earth and all they contain. Praise is to You, You are the King of the heavens and the earth. And praise is to You. You are the Truth, Your Promise is true, Your Word is true, Your audience is true, Paradise is true, Hell is true, the Prophets are true, and Muhammad (peace and blessings be upon him) is true, and the Hour of Judgment is true. O Allah, to You I have submitted, and upon You I depend. I have believed in You and to You I turn in repentance. For Your sake I dispute and by Your standard I judge. Forgive me what I have sent before me and what I have left behind me, what I have concealed and what I have declared. You are the One Who sends forth and"
                        }
                    ]
                },
                {
                    "chapter_name": "While rukoo",
                    "chapter_no": 17,
                    "verses": [
                        {
                            "arabic_text": "سُبْحَانَ رَبِّيَ الْعَظِيمِ",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_17_33.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_033.mp3",
                            "verse_no": 33,
                            "verse_text": "Glory to my Lord the Exalted. (Three times)"
                        },
                        {
                            "arabic_text": "سُبْحَانَكَ اللَّهُـمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_17_34.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_034.mp3",
                            "verse_no": 34,
                            "verse_text": "Glory is to You, O Allah, our Lord, and praise is Yours. O Allah, forgive me."
                        },
                        {
                            "arabic_text": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلاَئِكَةِ وَالرُّوحِ",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_17_35.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_035.mp3",
                            "verse_no": 35,
                            "verse_text": "Glory (to You), Most Holy (are You), Lord of the angels and the Spirit."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ خَشَعَ لَكَ سَمْعِي، وَبَصَرِي وَمُخِّي، وَعَظْمِي، وَعَصَبِي، وَمَا اسْتَقَلَّ بِهِ قَدَمِي",
                            "duration": 19000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_17_36.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_036.mp3",
                            "verse_no": 36,
                            "verse_text": "O Allah, to You I bow (in prayer) and in You I believe and to You I have submitted. Before You my hearing is humbled, as is my sight, my mind, my bones, my nerves and what my feet have mounted upon (for travel)."
                        },
                        {
                            "arabic_text": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_17_37.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_037.mp3",
                            "verse_no": 37,
                            "verse_text": "Glory is to You, Master of power, of dominion, of majesty and greatness."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon rising from the rukoo",
                    "chapter_no": 18,
                    "verses": [
                        {
                            "arabic_text": "سَمِـعَ اللَّهُ لِمَـنْ حَمِـدَه",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_18_38.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_038.mp3",
                            "verse_no": 38,
                            "verse_text": "Allah hears whoever praises Him."
                        },
                        {
                            "arabic_text": "رَبَّنَا وَلَكَ الْحَمْدُ، حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_18_39.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_039.mp3",
                            "verse_no": 39,
                            "verse_text": "Our Lord, praise is Yours, abundant, good and blessed praise."
                        },
                        {
                            "arabic_text": "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَما بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدْ. أَهلَ الثَّنَاءِ وَالْمَجْدِ، أََحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ. اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ",
                            "duration": 38000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_18_40.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_040.mp3",
                            "verse_no": 40,
                            "verse_text": "(A praise that) fills the heavens and the earth and what lies between them, and whatever else You please. (You Allah) are most worthy of praise and majesty, and what the slave has said, we are all Your slaves. O Allah, there is none who can withhold what You give, and none may give what You have withheld. And the might of the mighty person cannot benefit him against You."
                        }
                    ]
                },
                {
                    "chapter_name": "While sujood",
                    "chapter_no": 19,
                    "verses": [
                        {
                            "arabic_text": "سُبْحَانَ رَبِّيَ الأَعْلَى",
                            "duration": 12000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_19_41.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_041.mp3",
                            "verse_no": 41,
                            "verse_text": "Glory is to my Lord, the Most High. (Three times)"
                        },
                        {
                            "arabic_text": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
                            "duration": 12000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_19_42.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_042.mp3",
                            "verse_no": 42,
                            "verse_text": "Glory is to You, O Allah, our Lord, and praise is Yours. O Allah, forgive me."
                        },
                        {
                            "arabic_text": "سُبُّوحٌ، قُدُّسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ",
                            "duration": 14000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_19_43.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_043.mp3",
                            "verse_no": 43,
                            "verse_text": "Glory (to You), Most Holy (are You), Lord of the angels and the Spirit."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللّهُ أَحْسَنُ الْخَالِقِينَ",
                            "duration": 25000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_19_44.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_044.mp3",
                            "verse_no": 44,
                            "verse_text": "O Allah, to You I prostrate myself and in You I believe. To You I have submitted. My face is prostrated to the One Who created it, fashioned it, and gave it hearing and sight. Blessed is Allah, the Best of creators"
                        },
                        {
                            "arabic_text": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_19_45.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_045.mp3",
                            "verse_no": 45,
                            "verse_text": "Glory is to You, Master of power, of dominion, of majesty and greatness."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ وَعَلَانِيَتَهُ وَسِرَّهُ",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_19_46.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_046.mp3",
                            "verse_no": 46,
                            "verse_text": "O Allah, forgive me all my sins, great and small, the first and the last, those that are apparent and those that are hidden."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مَنْ عُقُوبَتِكَ، وَاَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                            "duration": 25000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_19_47.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_047.mp3",
                            "verse_no": 47,
                            "verse_text": "O Allah, I seek protection in Your pleasure from Your anger, and I seek protection in Your forgiveness from Your punishment. I seek protection in You from You. I cannot count Your praises. You are as You have praised Yourself."
                        }
                    ]
                },
                {
                    "chapter_name": "Sitting between the two sujood",
                    "chapter_no": 20,
                    "verses": [
                        {
                            "arabic_text": "رَبِّ اغْفِرْ لِي رَبِّ اغْفِرْ لِي",
                            "duration": 8000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_20_48.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_048.mp3",
                            "verse_no": 48,
                            "verse_text": "Lord, forgive me. My Lord, forgive me."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
                            "duration": 17000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_20_49.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_049.mp3",
                            "verse_no": 49,
                            "verse_text": "O Allah forgive me, have mercy on me, guide me, support me, protect me, provide for me and elevate me."
                        }
                    ]
                },
                {
                    "chapter_name": "When sujood due to recitation of the Quran",
                    "chapter_no": 21,
                    "verses": [
                        {
                            "arabic_text": "سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللَّهُ أَحسَنُ الْخَالِقِينَ",
                            "duration": 21000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_21_50.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_050.mp3",
                            "verse_no": 50,
                            "verse_text": "I have prostrated my face to the One Who created it, and gave it hearing and sight by His might and His power. Glory is to Allah, the Best of creators."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلْهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
                            "duration": 25000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_21_51.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_051.mp3",
                            "verse_no": 51,
                            "verse_text": "O Allah, write it as a reward for me, and release me from a burden for it, and make it a I treasure for me in Paradise. Accept it from me as You accepted it from your servant Dawud."
                        }
                    ]
                },
                {
                    "chapter_name": "The tashahhud",
                    "chapter_no": 22,
                    "verses": [
                        {
                            "arabic_text": "التَّحِيَّاتُ لِلّهِ، وَالصَّلَوَاتُ، وَالطَّيِّبَاتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللّهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ للّهِ الصَّالِحِينَ. أَشْهَدُ أَنْ لَا إِلَهَ إِلَاّ اللّهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
                            "duration": 47000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_22_52.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_052.mp3",
                            "verse_no": 52,
                            "verse_text": "All greetings of humility are for Allah, and all prayers and goodness. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous slaves of Allah. I bear witness that there is none worthy of worship but Allah, and I bear witness that Muhammad is His slave and His Messenger."
                        }
                    ]
                },
                {
                    "chapter_name": "Prayers upon the Prophet saw after the tashahhud",
                    "chapter_no": 23,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحمَّد، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إبْرَاهِيمَ، إِنَّكَ حَميدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحمَّدٌ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إبْرَاهِيمَ وَعَلَى آلِ إبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
                            "duration": 51000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_23_53.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_053.mp3",
                            "verse_no": 53,
                            "verse_text": "O Allah, bestow Your favor on Muhammad and on the family of Muhammad as You have bestowed Your favor on Ibrahim and on the family of Ibrahim, You are Praiseworthy, Most Glorious. O Allah, bless Muhammad and the family of Muhammad as You have blessed Ibrahim and the family of Ibrahim, You are Praiseworthy, Most Glorious."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ صَلِّ عَلَى مُحمَّدٍ وَعَلَى أَزْوَاجِـهِ وَذُرِّيَّـتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إبْرَاهِيمَ. وَبَارِكْ عَلَى مُحمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
                            "duration": 46000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_23_54.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_054.mp3",
                            "verse_no": 54,
                            "verse_text": "O Allah, bestow Your favor on Muhammad and upon his wives and progeny as You have best owed Your favor upon the family of Ibrahim. And bless Muhammad and his wives and progeny as You have blessed the family of Ibrahim, You are full of praise, Most Glorious."
                        }
                    ]
                },
                {
                    "chapter_name": "After the final tashahhud and before salam",
                    "chapter_no": 24,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ القَبْر، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسيحِ الدَّجَّالِ",
                            "duration": 27000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_55.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_055.mp3",
                            "verse_no": 55,
                            "verse_text": "O Allah, I seek refuge in You from the punishment of the grave, and from the punishment of Hell-fire, and from the trials of life and death, and from the evil of the trial of the False Messiah."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ القَبْر، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْـيَا وَالْمَمَاتِ . اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
                            "duration": 33000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_56.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_056.mp3",
                            "verse_no": 56,
                            "verse_text": "O Allah, I seek refuge in You from the punishment of the grave, and I seek refuge in You from the trial of the False Messiah, and I seek refuge in You from the trials of life and death. O Allah, I seek refuge in You from sin and from debt."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً وَلَا يَغْفِرُ الذُّنُوبَ إِلَاَّ أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
                            "duration": 31000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_57.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_057.mp3",
                            "verse_no": 57,
                            "verse_text": "O Allah, I have greatly wronged myself and no one forgives sins but You. So, grant me forgiveness and have mercy on me. Surely, you are Forgiving, Merciful."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لَا إِلهَ إِلَاَّ أَنْتَ",
                            "duration": 33000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_58.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_058.mp3",
                            "verse_no": 58,
                            "verse_text": "O Allah, forgive me what I have sent before me and what I have left behind me, what I have concealed and what I have done openly, what I have done in excess, and what You are better aware of than I. You are the One Who sends forth and You are the One Who delays. There is none worthy of worship but You."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
                            "duration": 12000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_59.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_059.mp3",
                            "verse_no": 59,
                            "verse_text": "O Allah, help me to remember You, to give You thanks, and to perform Your worship in the best manner."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ البُخْلِ، وَأَعُوذُ بِكَ مِنَ الجُبْنِ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُر، وَأََعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ القَبْرِ",
                            "duration": 27000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_60.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_060.mp3",
                            "verse_no": 60,
                            "verse_text": "O Allah, I seek Your protection from miserliness, I seek Your protection from cowardice, and I seek Your protection from being returned to feeble old age. I seek Your protection from the trials of this world and from the torment of the grave."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وأََعُوذُ بِكَ مِنَ النَّارِ",
                            "duration": 16000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_61.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_061.mp3",
                            "verse_no": 61,
                            "verse_text": "O Allah, I ask You for Paradise and seek Your protection from the Fire."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لَا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعْ، وَأَسْأَلُكَ الرِّضَا بَعْدَ القَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْت، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلا فِتْنَةٍ مُضلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الِإيـمَانِ وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
                            "duration": 97000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_62.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_062.mp3",
                            "verse_no": 62,
                            "verse_text": "O Allah, by Your Knowledge of the unseen and by Your Power over creation, let me live if You know that life is good for me, and let me die if You know that death is good for me. O Allah, I ask You to grant me fear of You in private and in public. I ask you for the word of truth in times of contentment and anger. I ask You for moderation in wealth and in poverty. I ask you for blessings never ceasing and the coolness of my eye that never ends. I ask You for pleasure after Your Judgment and I ask You for a life of coolness after death. I ask You for the delight of gazing upon Your Face and the joy of meeting You without any harm and misleading trials befalling me. O Allah, dress us with the beauty of Faith, and make us guides who are upon (correct) guidance."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ بِأَنَّكَ الْوَاحِدُ الأَحَدُ، الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدُ، أَنْ تَغْفِرْ لِي ذُنُوبِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِّيمُ",
                            "duration": 36000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_63.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_063.mp3",
                            "verse_no": 63,
                            "verse_text": "O Allah, I ask You. O Allah, You are the One, the Only, Self-Sufficient Master, Who was not begotten and begets not and none is equal to Him. Forgive me my sins, surely you are Forgiving, Merciful."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدُ لاَ إِلَهَ إِلَاَّ أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالأَرْضِ يَاذَا الْجَلَالِ وَالإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّي أَسْأَلُكَ الجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
                            "duration": 50000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_64.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_064.mp3",
                            "verse_no": 64,
                            "verse_text": "O Allah, I ask You, as You are the Owner of praise, there is none worthy of worship but You alone, You have no partner. You are the Giver of all good. O Creator of the heavens and the earth, Owner of majesty and honor. O Living and Everlasting One, I ask you for Paradise and I seek refuge in You from the fire."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّي أَشْهَدُ أَنَّكَ أنْتَ اللَّهُ لَا إِلَهَ إِلَاَّ أَنْتَ، الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
                            "duration": 31000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_24_65.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_065.mp3",
                            "verse_no": 65,
                            "verse_text": "O Allah, I ask You, by the fact that I bear witness that You are Allah. There is none worthy of worship but You, the Only God, Independent of creation, Who was not begotten and begets not, and none is equal to Him."
                        }
                    ]
                },
                {
                    "chapter_name": "Remembrance after salam",
                    "chapter_no": 25,
                    "verses": [
                        {
                            "arabic_text": "(1)أَسْتَغْفِرُ اللَّهَ(2)اللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالإِكْرَامِ",
                            "duration": 25000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_25_66.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_066.mp3",
                            "verse_no": 66,
                            "verse_text": "I seek the forgiveness of Allah. (Three times)(1)O Allah, You are Peace and from You comes peace. Blessed are You, O Owner of majesty and honor.(2)"
                        },
                        {
                            "arabic_text": "لَا إلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
                            "duration": 33000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_25_67.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_067.mp3",
                            "verse_no": 67,
                            "verse_text": "None has the right to be worshiped but Allah alone, He has no partner, His is the dominion and His is the praise, and He is Able to do all things. O Allah, there is none who can withhold what You give, and none may give what You have withheld; and the might of the mighty person cannot benefit him against You."
                        },
                        {
                            "arabic_text": "لاَ إلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلاَ قُوَّةَ إِلَاَّ بِاللَّهِ، لَا إِلَهَ إِلَاَّ اللَّهُ، وَلَا نَعْبُدُ إِلَاَّ إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلاَّ اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ",
                            "duration": 63000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_25_68.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_068.mp3",
                            "verse_no": 68,
                            "verse_text": "None has the right to be worshiped but Allah alone, He has no partner, His is the dominion and His is the praise and He is Able to do all things. There is no power and no might except by Allah. None has the right to be worshiped but Allah, and we do not worship any other besides Him. His is grace, and His is bounty and to Him belongs the most excellent praise. None has the right to be worshiped but Allah. (We are) sincere in making our religious devotion to Him, even though the disbelievers may dislike it."
                        },
                        {
                            "arabic_text": "(1)سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَاللَّهُ أَكْبَرُ(2)لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                            "duration": 33000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_25_69.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_069.mp3",
                            "verse_no": 69,
                            "verse_text": "Glory is to Allah, and praise is to Allah, and Allah is the Most Great. (Thirty-Three times each)(1)None has the right to be worshiped but Allah alone, He has no partner, His is the dominion and His is the praise and He is Able to do all things.(2)(Whoever says this after every prayer will be forgiven his sins even though they be as the foam of the sea.)"
                        },
                        {
                            "arabic_text": "قُلْ هُوَ اللَّـهُ أَحَدٌ، اللَّـهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ.\n\nقُلْ أَعُوذُ بِرَ‌بِّ الْفَلَقِ، مِن شَرِّ‌ مَا خَلَقَ، وَمِن شَرِّ‌ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ‌ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ‌ حَاسِدٍ إِذَا حَسَدَ.\n\nقُلْ أَعُوذُ بِرَ‌بِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَـٰهِ النَّاسِ، مِن شَرِّ‌ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ‌ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ.\n",
                            "duration": 108000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_25_70.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_070.mp3",
                            "verse_no": 70,
                            "verse_text": "Recite Al-Ikhlas, Al-Falaq and An-Nas"
                        },
                        {
                            "arabic_text": "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
                            "duration": 68000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_25_71.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_071.mp3",
                            "verse_no": 71,
                            "verse_text": "Allah! There is none worthy of worship but He, the Ever Living, the One Who sustains and protects all that exists. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them in this world, and what will happen to them in the Hereafter. And they will never compass anything of His Knowledge except that which He wills. His Throne extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great."
                        },
                        {
                            "arabic_text": "لَا إِلَهَ إِلَّا اللَّهُ وَحَدْهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                            "duration": 25000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_25_72.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_072.mp3",
                            "verse_no": 72,
                            "verse_text": "None has the right to be worshiped but Allah alone, Who has no partner. His is the dominion and His is the praise. He brings life and He causes death, and He is Able to do all things. (Ten times after the Maghrib and Fajr prayers.)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً",
                            "duration": 16000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_25_73.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_073.mp3",
                            "verse_no": 73,
                            "verse_text": "O Allah, I ask You for knowledge that is of benefit, a good provision, and deeds that will be accepted. (Recite after the Fajr prayer.)"
                        }
                    ]
                },
                {
                    "chapter_name": "Qunoot in the Witr prayer",
                    "chapter_no": 32,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ، وَلَا يَعِزُّ مَنْ عَادَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
                            "duration": 62000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_32_116.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_116.mp3",
                            "verse_no": 116,
                            "verse_text": "O Allah, guide me with those whom You have guided, and strengthen me with those whom You have given strength. Take me to Your care with those whom You have taken to Your care. Bless me in what You have given me. Protect me from the evil You have ordained. Surely, You command and are not commanded, and none whom You have committed to Your care shall be humiliated (and none whom You have taken as an enemy shall taste glory). You are Blessed, Our Lord, and Exalted."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                            "duration": 29000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_32_117.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_117.mp3",
                            "verse_no": 117,
                            "verse_text": "O Allah, I seek refuge with Your Pleasure from Your anger. I seek refuge in Your forgiveness from Your punishment. I seek refuge in You from You. I cannot count Your praises, You are as You have praised Yourself."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالْكَافِرِينَ مُلْحَقٌ. اللَّهُمَّ إِنَّا نَسْتَعِينُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الْخَيْرَ، وَلَا نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
                            "duration": 45000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_32_118.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_118.mp3",
                            "verse_no": 118,
                            "verse_text": "O Allah, You alone do we worship and to You we pray and bow down prostrate. To You we hasten to worship and to serve. Our hope is for Your mercy and we fear Your punishment. Surely, Your punishment of the disbelievers is at hand. O Allah, we seek Your help and Your forgiveness, and we praise You beneficently. We do not deny You and we believe in You. We surrender to You and renounce whoever disbelieves in You."
                        }
                    ]
                },
                {
                    "chapter_name": "Immediately after salam of the Witr prayer",
                    "chapter_no": 33,
                    "verses": [
                        {
                            "arabic_text": "(1)سُبْحَانَ الْمَلِكِ الْقُدُوسِ(2)رَبُّ الْمَلَائِكَةِ وَالرُّوحِ",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_33_119.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_119.mp3",
                            "verse_no": 119,
                            "verse_text": "Glory is to the King, the Holy. (Three times and raise and extend the voice on the third time and say...)(1)Lord of the angels and the Spirit.(2)"
                        }
                    ]
                },
                {
                    "chapter_name": "For one afflicted by whisperings in prayer or recitation",
                    "chapter_no": 42,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجيمِ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_42_138.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_138.mp3",
                            "verse_no": 138,
                            "verse_text": "I seek refuge in Allah from Satan the outcast. Then spit to your left three times."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Praising Allah",
            "category_no": 7,
            "chapter_count": 9,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "For seeking guidance in forming a decision",
                    "chapter_no": 26,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْتَخِيـرُكَ بِعِلْمَكَ، وَأسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلاَّمُ الْغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الَأمْرَ (وَيُسَمِّي حَاجَتَه) خَيْرٌ\n لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي، فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي، فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِي بِهِ",
                            "duration": 83000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_26_74.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_074.mp3",
                            "verse_no": 74,
                            "verse_text": "O Allah, I seek the counsel of Your Knowledge, and I seek the help of Your Omnipotence, and I beseech You for Your Magnificent Grace. Surely, You are Capable and I am not. You know and I know not, and You are the Knower of the unseen. O Allah, if You know that this matter (mention the matter) is good for me in my religion and in my life and for my welfare in the life to come in both the short term and the long term, then ordain it for me and make it easy for me, then bless me in it. And if You know that this matter is bad for me in my religion and in my life and for my welfare in the life to come in both the short term and the long term, then distance it from me, and distance me from it, and ordain for me what is good wherever it may be, and help me to be content with it."
                        }
                    ]
                },
                {
                    "chapter_name": "For one whos affairs have become difficult",
                    "chapter_no": 43,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ لَا سَهْلَ إِلَاَّ مَا جَعَلتَهُ سَهْلاً وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلاً",
                            "duration": 16000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_43_139.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_139.mp3",
                            "verse_no": 139,
                            "verse_text": "O Allah, there is no ease other than what You make easy. If You please You ease sorrow."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon committing a sin",
                    "chapter_no": 44,
                    "verses": [
                        {
                            "arabic_text": "ما من عبد يذنب ذنبا فيحسن الطهور , ثم يقوم فيصلي ركعتين , ثم يستغفر الله إلا غفر الله له",
                            "duration": 20000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_44_140.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_140.mp3",
                            "verse_no": 140,
                            "verse_text": "There is not any slave of Allah who commits a sin, then he perfects his ablution and stands to pray two rak'ah of prayer, then seeks Allah's forgiveness, except that Allah will forgive him."
                        }
                    ]
                },
                {
                    "chapter_name": "When stricken with a mishap or overtaken by an affair",
                    "chapter_no": 46,
                    "verses": [
                        {
                            "arabic_text": "قَدَّرَ اللَّهُ وَمَا شَاءَ فَعَلَ",
                            "duration": 4000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_46_144.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_144.mp3",
                            "verse_no": 144,
                            "verse_text": "It is the Decree of Allah and He does whatever He wills.(The strong believer is better and more dear to Allah than the weak believer, and in each of them there is good. Be vigilant for what is to your benefit and seek the help of Allah and do not falter. But when you are stricken by some setback, do not say: \"If only I had done such and such...\" rather say: \"It is the Decree of Allah and He does whatever He wills\". For verily the saying 'if...' begins the work of the Devil.)"
                        }
                    ]
                },
                {
                    "chapter_name": "Protection from the Dajjal",
                    "chapter_no": 88,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_88_199.jpeg",
                            "verse_no": 199,
                            "verse_text": "Whoever memorizes ten 'ayat (Verses) from the beginning of Surat Al-Kahf, will be protected from the False Messiah. If he recites them in every prayer after the final Tashahhud before ending the prayer, seeking the protection of Allah from the trials of the False Messiah."
                        }
                    ]
                },
                {
                    "chapter_name": "Excellence of sending prayers upon the Prophet saws",
                    "chapter_no": 107,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_107_219.jpeg",
                            "verse_no": 219,
                            "verse_text": "The Prophet (SAW) said: \"Whoever prays for Allah's blessings upon me once, will be blessed for it by Allah ten times\"."
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_107_220.jpeg",
                            "verse_no": 220,
                            "verse_text": "The Prophet (SAW) said: Do not make my grave a place of ritual celebration, but pray for Allah's blessings upon me, for your blessings reach me from wherever you are."
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_107_221.jpeg",
                            "verse_no": 221,
                            "verse_text": "The Prophet (SAW) said: The miser is the one in whose presence I am mentioned yet does not pray for Allah's blessings upon me."
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_107_222.jpeg",
                            "verse_no": 222,
                            "verse_text": "The Prophet (SAW) said: Indeed Allah has angels who roam the earth and they convey to me the greetings (or prayers of peace) of my 'ummah (nation)."
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_107_223.jpeg",
                            "verse_no": 223,
                            "verse_text": "The Prophet (SAW) said: No one sends greetings (or prayers of peace) upon me but Allah returns my soul to me so that I may return his greetings."
                        }
                    ]
                },
                {
                    "chapter_name": "Seeking forgiveness and repentance",
                    "chapter_no": 129,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_129_248.jpeg",
                            "verse_no": 248,
                            "verse_text": "The Prophet (SAW) said: \"By Allah, I seek the forgiveness of Allah, and repent to Him more than Seventy times in a day\"."
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_129_249.jpeg",
                            "verse_no": 249,
                            "verse_text": "The Prophet (SAW) said: \"O people, repent to Allah, for I verily repent to Him one hundred times a day\"."
                        },
                        {
                            "arabic_text": "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إلَّا هُوَ الْحَيُّ القَيُّومُ وَأَتُوبُ إِلَيهِ",
                            "duration": 20000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_129_250.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_250.mp3",
                            "verse_no": 250,
                            "verse_text": "I seek the forgiveness of Allah the Mighty, Whom there is none worthy of worship except Him, the Living, the Eternal, and I repent to Him(Allah will forgive him even if he has deserted the army's ranks.)"
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_129_251.jpeg",
                            "verse_no": 251,
                            "verse_text": "The Prophet (SAW) said: \"The closest that the Lord comes to the slave is in the last portion of the night. So, if you are able to be among those who remember Allah in this hour, then be among them\"."
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_129_252.jpeg",
                            "verse_no": 252,
                            "verse_text": "The Prophet (SAW) said: \"The closest that the slave comes to his Lord is when he is prostrating, so invoke Allah much (in prostration)\"."
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_129_253.jpeg",
                            "verse_no": 253,
                            "verse_text": "The Prophet (SAW) said: \"Verily my heart becomes preoccupied, and verily I seek Allah's forgiveness a hundred times a day\"."
                        }
                    ]
                },
                {
                    "chapter_name": "Excellence of remembrance and glorification of Allah",
                    "chapter_no": 130,
                    "verses": [
                        {
                            "arabic_text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
                            "duration": 4000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_254.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_254.mp3",
                            "verse_no": 254,
                            "verse_text": "The Prophet (SAW) said: \"Whoever says: \"Glorified is Allah and praised is He\" one hundred times a day, will have his sins forgiven even if they are like the foam of the sea\"."
                        },
                        {
                            "arabic_text": "لَا إِلهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                            "duration": 16000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_255.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_255.mp3",
                            "verse_no": 255,
                            "verse_text": "The Prophet (SAW) said: \"Whoever says: \"None has the right to be worshiped but Allah alone, Who has no partner. His is the dominion and His is the praise, and He is Able to do all things\" ten times, will have the reward for freeing four slaves from the Children of Isma'il\"."
                        },
                        {
                            "arabic_text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ وسُبْحَانَ اللَّهِ الْعَظِيمِ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_256.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_256.mp3",
                            "verse_no": 256,
                            "verse_text": "The Prophet (SAW) said: \"Two words are light on the tongue, weigh heavily in the balance, and are loved by the Most Merciful One is: \"Glorified is Allah and praised is He, Glorified is Allah the Most Great\"."
                        },
                        {
                            "arabic_text": "سُبْحَانَ اللَّهِ، وَالحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_257.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_257.mp3",
                            "verse_no": 257,
                            "verse_text": "The Prophet (SAW) said: For me to say: \"Glory is to Allah, and praise is to Allah, and there is none worthy of worship but Allah, and Allah is the Most Great\" is dearer to me than all that the sun rises upon\"."
                        },
                        {
                            "arabic_text": "سُبْحَانَ اللَّهِ",
                            "duration": 4000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_258.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_258.mp3",
                            "verse_no": 258,
                            "verse_text": "The Prophet (SAW) said: \"Is anyone of you incapable of earning one thousand Hasanah (rewards) in a day?\" Someone from his gathering asked: \"How can anyone of us earn a thousand Hasanah\" He said: \"Glorify Allah a hundred times and a thousand Hasanah will be written for you, or a thousand sins will be wiped away\"."
                        },
                        {
                            "arabic_text": "سُبْحَانَ اللَّهِ الْعَظِيمِ وبِحَمْدِهِ",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_259.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_259.mp3",
                            "verse_no": 259,
                            "verse_text": "The Prophet (SAW) said: \"Glorified is Allah the Most Great and praised is He. Will have a date palm planted for him in Paradise\"."
                        },
                        {
                            "arabic_text": "لَا حَوٍلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
                            "duration": 7000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_260.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_260.mp3",
                            "verse_no": 260,
                            "verse_text": "The Prophet (SAW) said: \"O Abdullah bin Qais, should I not point you to one of the treasures of Paradise?\" I said: \"Yes, O Messenger of Allah\". So he told me to say: \"There is no power and no might except by Allah\"."
                        },
                        {
                            "arabic_text": "(1)سُبْحَانَ اللَّهِ(2)وَالحَمْدُ للَّهِ(3)وَلَا إِلَهَ إِلاَّ اللَّهُ(4)وَاللَّهُ أَكْبَرُ",
                            "duration": 19000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_261.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_261.mp3",
                            "verse_no": 261,
                            "verse_text": "The Prophet (SAW) said: \"The most beloved words to Allah are four:Glorified is Allah,(1)The praise is for Allah,(2)There is none worthy of worship but Allah,(3)Allah is the Most Great\".(4)"
                        },
                        {
                            "arabic_text": "(1)لَا إِلهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، اللَّهُ أَكْبَرُ كَبيراً، وَالْحَمْدُ للَّهِ كَثيراً، سُبْحَانَ اللَّهِ رَبِّ الْعَالَمِينَ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَزِيزِ الْحَكِيمِ(2)اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَارْزُقْنِي",
                            "duration": 33000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_262.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_262.mp3",
                            "verse_no": 262,
                            "verse_text": "A desert Arab came to Allah's Messenger (SAW) and said: \"Teach me a word that I can say\". The Prophet told him to say: \"There is none worthy of worship but Allah, Who has no partner, Allah is the Great, the Most Great, and praise is to Allah in abundance, glory is to Allah, Lord of the worlds. There is no power and no might but by Allah the Mighty, the Wise\". (1) He said: \"That is for my Lord, but what about me?\" The Prophet (SAW) told him to say: \"O Allah forgive me, and have mercy on me and guide me, and provide for me\". (2)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ اغْفِرِ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي وَارْزُقْنِي",
                            "duration": 10000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_263.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_263.mp3",
                            "verse_no": 263,
                            "verse_text": "O Allah forgive me, and have mercy on me and guide me and give me good health and provide for me."
                        },
                        {
                            "arabic_text": "(1)الْحَمْدُ لِلَّهِ(2)لَا إِلَه إِلَّا اللَّهُ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_264.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_264.mp3",
                            "verse_no": 264,
                            "verse_text": "The most excellent invocation is:\"Praise is for Allah\".(1)\"There is none worthy of worship but Allah\".(2)"
                        },
                        {
                            "arabic_text": "سُبْحَانَ اللَّهِ، وَالْحَمْدُ للَّهِ، لَا إِلَهَ إَلَّا اللَّهُ واللَّهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إلَّا باللَّهِ",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_130_265.jpeg",
                            "verse_no": 265,
                            "verse_text": "The good deeds which endure are: \"Glorified is Allah, The praise is for Allah, There is none worth of worship but Allah, Allah is the Most Great and There is no power and no might except by Allah\"."
                        }
                    ]
                },
                {
                    "chapter_name": "How the Prophet made Tasbeeh",
                    "chapter_no": 131,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_131_266.jpeg",
                            "verse_no": 266,
                            "verse_text": "Abdullah Bin Amru said: \"I saw the Prophet (SAW) counting the glorification of his Lord on his right hand\"."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Hajj & Umrah",
            "category_no": 8,
            "chapter_count": 8,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "The Talbiya for the one doing Haj or Umrah",
                    "chapter_no": 115,
                    "verses": [
                        {
                            "arabic_text": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ والنِّعْمَةَ، لَكَ والْمُلْكُ، لَا شَرِيكَ لَكَ",
                            "duration": 20000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_115_233.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_233.mp3",
                            "verse_no": 233,
                            "verse_text": "I am here at Your service, O Allah, I am here at Your service. I am here at Your service, You have no partner, I am here at Your service. Surely the praise, and blessings are Yours, and the dominion. You have no partner."
                        }
                    ]
                },
                {
                    "chapter_name": "The Takbeer passing the black stone",
                    "chapter_no": 116,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُ أَكْبَرُ",
                            "duration": 3000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_116_234.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_234.mp3",
                            "verse_no": 234,
                            "verse_text": "The Prophet (SAW) performed Tawaf riding a camel. Every time he passed the corner (containing the Black Stone), he would point to it with something that he was holding and say: Allaahu 'Akbar. (Allah is the Most Great)(The 'something' that was referred to in this Hadith was a cane.)"
                        }
                    ]
                },
                {
                    "chapter_name": "Between the Yemeni corner and the black stone",
                    "chapter_no": 117,
                    "verses": [
                        {
                            "arabic_text": "رَبَّنَا آتِنَا فِي الْدُّنْيَا حَسَنَةً وَفِي الَأخِرَةِ حَسَنةً وَقِنَا عَذَابَ النَّارِ",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_117_235.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_235.mp3",
                            "verse_no": 235,
                            "verse_text": "Our Lord, grant us the good things\n in this world and the good things in the next life and save us from the punishment of the Fire."
                        }
                    ]
                },
                {
                    "chapter_name": "When at Mount Safa and Mount Marwah",
                    "chapter_no": 118,
                    "verses": [
                        {
                            "arabic_text": "(1)إِنَّ الصَّفَا وَالمَرْوَةَ مِنْ شَعَائِرِاللَّهِ. أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ(2) اللَّهُ أَكْبَرُ،  اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ(3) لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأَحْزَابَ وَحْدَهُ",
                            "duration": 57000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_118_236.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_236.mp3",
                            "verse_no": 236,
                            "verse_text": "Whenever the Prophet (SAW) approached Mount Safa, he would recite: \"Surely Safa and Marwah are among the signs of Allah. I begin by that which Allah began\".(1) Then he began (his Sa'y) at Mount Safa climbing it until he could see the House (Kaaba). He then faced the Qiblah repeating the words: \"Allah is the Most Great, Allah is the Most Great, Allah is the Most Great\".(2) Then he said: \"None has the right to be worshiped but Allah alone, Who has no partner, His is the dominion and His is the praise, and He is Able to do all things. None has the right to be worshiped but Allah alone, He fulfilled His Promise, He aided His slave, and He alone defeated Confederates\".(3) Then he would ask Allah for what he liked, repeating the same thing like this Three times. He did at Mount Marwah as he did at Mount Safa."
                        }
                    ]
                },
                {
                    "chapter_name": "The Day of 'Arafah",
                    "chapter_no": 119,
                    "verses": [
                        {
                            "arabic_text": "لاَ إِلَهَ إِلاَّ اللّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                            "duration": 18000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_119_237.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_237.mp3",
                            "verse_no": 237,
                            "verse_text": "The best invocation is that of the Day of Arafat, and the best that anyone can say is what I and the Prophets before me have said: \"None has the right to be worshiped but Allah alone, Who has no partner. His is the dominion and His is the praise, and He is Able to do all things\"."
                        }
                    ]
                },
                {
                    "chapter_name": "Remembrance at Muzdalifa",
                    "chapter_no": 120,
                    "verses": [
                        {
                            "arabic_text": "(1)اللَّهُ أَكْبَرُ(2)لاَ إِلَهَ إِلاَّ اللَّهُ(3)اللَّهُ اَحَدٌ",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_120_238.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_238.mp3",
                            "verse_no": 238,
                            "verse_text": "The Prophet (SAW) rode his camel, Al-Qaswa' (from Arafah), until he reached the sacred area (Al-Mash'aril-Haraam). Then he faced the Qiblah and invoked Allah, and repeatedly said:\"Allah is the Most Great\",(1)\"There is none worthy of worship but Allah\"(2) and\"Allah is One\".(3)He remained stationary until the sky became yellow with the dawn, and then pressed on before sunrise."
                        }
                    ]
                },
                {
                    "chapter_name": "When throwing each pebble at the Jamarat",
                    "chapter_no": 121,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُ أكْبَرُ",
                            "duration": 3000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_121_239.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_239.mp3",
                            "verse_no": 239,
                            "verse_text": "The Prophet (SAW) said Allaahu 'Akbar (Allah is the Most Great) with each pebble he threw at the Three pillars. Then he went forward, stood facing the Qiblah and raised his hands and called upon Allah. That was after (stoning) the first and second pillar. As for the third, he stoned it and called out Allaahu 'Akbar with every pebble he threw, but when he was finished he left without standing at it (for supplications)."
                        }
                    ]
                },
                {
                    "chapter_name": "When slaughtering or offering a sacrifice",
                    "chapter_no": 127,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ اللَّهُمَّ مِنْكَ ولَكَ اللَّهُمَّ تَقَبَّلْ مِنِّي",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_127_246.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_246.mp3",
                            "verse_no": 246,
                            "verse_text": "With the Name of Allah, Allah is the Most Great! (O Allah, from You and to You.) O Allah, accept it from me."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Good Etiquette",
            "category_no": 9,
            "chapter_count": 20,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "Congratulation on the occasion of a birth",
                    "chapter_no": 47,
                    "verses": [
                        {
                            "arabic_text": "(1)بَارَكَ اللَّهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَ شَكَرْتَ الْوَاهِبَ، وَبَلَغَ أَشُدَّهُ، وَرُزِقْتَ بِرَّهُ(2)بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ، َوجَزَاكَ اللَّهُ خَيْراً، وَرَزَقَكَ اللَّهُ مِثْلَهُ، وأَجْزَلَ ثَوَابَك",
                            "duration": 32000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_47_145.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_145.mp3",
                            "verse_no": 145,
                            "verse_text": "May Allah bless you with His gift to you, and may you (the new parent) give thanks, may the child reach the maturity of years, and may you be granted its righteousness.(1)The reply of the person being congratulated is to say: \"May Allah bless you, and shower His blessings upon you, and may Allah reward you well and bestow upon you its like and reward you abundantly\".(2)"
                        }
                    ]
                },
                {
                    "chapter_name": "When insulted while fasting",
                    "chapter_no": 75,
                    "verses": [
                        {
                            "arabic_text": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ",
                            "duration": 6000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_75_186.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_186.mp3",
                            "verse_no": 186,
                            "verse_text": "I am fasting. I am fasting."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon sneezing",
                    "chapter_no": 77,
                    "verses": [
                        {
                            "arabic_text": "(1)الْحَمْدُ للَّهِ(2)يَرْحَمُكَاللَّهُ(3)يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُم",
                            "duration": 15000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_77_188.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_188.mp3",
                            "verse_no": 188,
                            "verse_text": "When you sneeze, then say: \"All praises and thanks are to Allah\".(1)Your companion should say: \"May Allah have mercy upon you\".(2)Then you should replies: \"May Allah guide you and set your affairs in order\".(3)"
                        }
                    ]
                },
                {
                    "chapter_name": "When a misbeliever praise Allah after sneezing",
                    "chapter_no": 78,
                    "verses": [
                        {
                            "arabic_text": "يَهْديكُمُ اللَّهُ وَيُصْلِحُ بالَكُم",
                            "duration": 6000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_78_189.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_189.mp3",
                            "verse_no": 189,
                            "verse_text": "May Allah guide you and rectify your condition."
                        }
                    ]
                },
                {
                    "chapter_name": "On the wedding night or when buying an animal",
                    "chapter_no": 80,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ",
                            "duration": 22000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_80_191.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_191.mp3",
                            "verse_no": 191,
                            "verse_text": "When any of you marries a woman or purchases a maid-servant then let him say: \"O Allah, I ask You for the goodness of her and the goodness upon which You have created her, and I seek refuge in You from the evil of her and from the evil upon which You have created her\". If you purchase a camel (animal) then take hold of the top of its hump and say the same."
                        }
                    ]
                },
                {
                    "chapter_name": "When angry",
                    "chapter_no": 82,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجيـمِ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_82_193.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_193.mp3",
                            "verse_no": 193,
                            "verse_text": "I seek refuge in Allah from Satan the outcast."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon seeing someone in trial or tribulation",
                    "chapter_no": 83,
                    "verses": [
                        {
                            "arabic_text": "الْحَمْدُ للَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلَاكَ بِهِ وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلًا",
                            "duration": 17000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_83_194.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_194.mp3",
                            "verse_no": 194,
                            "verse_text": "Praise is to Allah Who has spared me what He has afflicted you with, and preferred me greatly above much of what He has created."
                        }
                    ]
                },
                {
                    "chapter_name": "At a sitting or gathering",
                    "chapter_no": 84,
                    "verses": [
                        {
                            "arabic_text": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الْغَفُورُ",
                            "duration": 14000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_84_195.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_195.mp3",
                            "verse_no": 195,
                            "verse_text": "My Lord, forgive me and accept my repentance, You are the Ever-Relenting, the All-Forgiving."
                        }
                    ]
                },
                {
                    "chapter_name": "For the expiation of sins, said at the conclusion of a sitting or gathering",
                    "chapter_no": 85,
                    "verses": [
                        {
                            "arabic_text": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلهَ إِلَاَّ أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
                            "duration": 20000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_85_196.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_196.mp3",
                            "verse_no": 196,
                            "verse_text": "Glory is to You, O Allah, and praise is to You. I bear witness that there is none worthy of worship but You. I seek Your forgiveness and repent to You.(Allah's Messenger (SAW) did not sit in a gathering, and did not recite the Qur'an, and did not perform any prayer without concluding by saying this invocation.)"
                        }
                    ]
                },
                {
                    "chapter_name": "Returning a supplication of forgiveness",
                    "chapter_no": 86,
                    "verses": [
                        {
                            "arabic_text": "وَلَكَ",
                            "duration": 1000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_86_197.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_197.mp3",
                            "verse_no": 197,
                            "verse_text": "And you."
                        }
                    ]
                },
                {
                    "chapter_name": "To one who does you a favour",
                    "chapter_no": 87,
                    "verses": [
                        {
                            "arabic_text": "جَزَاكَ اللَّهُ خَيْراً",
                            "duration": 3000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_87_198.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_198.mp3",
                            "verse_no": 198,
                            "verse_text": "May Allah reward you with good."
                        }
                    ]
                },
                {
                    "chapter_name": "To one who pronounces his love for you, for Allah’s sake",
                    "chapter_no": 89,
                    "verses": [
                        {
                            "arabic_text": "أَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_89_200.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_200.mp3",
                            "verse_no": 200,
                            "verse_text": "May He for Whose sake you love me, love you."
                        }
                    ]
                },
                {
                    "chapter_name": "To one who has offered you some of his wealth",
                    "chapter_no": 90,
                    "verses": [
                        {
                            "arabic_text": "بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ",
                            "duration": 5000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_90_201.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_201.mp3",
                            "verse_no": 201,
                            "verse_text": "May Allah bless you in your family and your property."
                        }
                    ]
                },
                {
                    "chapter_name": "To the debtor when his debt is settled",
                    "chapter_no": 91,
                    "verses": [
                        {
                            "arabic_text": "بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالأَدَاءُ",
                            "duration": 14000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_91_202.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_202.mp3",
                            "verse_no": 202,
                            "verse_text": "May Allah bless you in your family and your wealth, surely the reward for a loan is praise and returning (what was borrowed)."
                        }
                    ]
                },
                {
                    "chapter_name": "Returning a supplication after having bestowed a gift or charity upon someone",
                    "chapter_no": 93,
                    "verses": [
                        {
                            "arabic_text": "وَفِيكَ بَارَكَاللَّهُ",
                            "duration": 6000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_93_204.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_204.mp3",
                            "verse_no": 204,
                            "verse_text": "And may Allah bless you."
                        }
                    ]
                },
                {
                    "chapter_name": "Excellence of spreading the Islamic greeting",
                    "chapter_no": 108,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_108_224.jpeg",
                            "verse_no": 224,
                            "verse_text": "You shall not enter Paradise until you believe, and you have not believed until you love one another. Shall I tell you of something you can do to make you love one another? Spread the greetings of Salam (peace) amongst yourselves."
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_108_225.jpeg",
                            "verse_no": 225,
                            "verse_text": "There are Three things which whoever gathers all of them together, then he has gathered Iman (Faith): justice with oneself, greeting people with greetings of Salam (peace), and freeing oneself from stinginess."
                        },
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_108_226.jpeg",
                            "verse_no": 226,
                            "verse_text": "A man asked the Prophet (SAW), What is the best act of Islam? He said, To feed others and to give greetings of Salam (peace) to those whom you know and to those whom you do not know."
                        }
                    ]
                },
                {
                    "chapter_name": "Returning a greeting to a misbeliever",
                    "chapter_no": 109,
                    "verses": [
                        {
                            "arabic_text": "وَعَلَيْكُمْ",
                            "duration": 3000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_109_227.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_227.mp3",
                            "verse_no": 227,
                            "verse_text": "If one of the Christians and Jews (People of the Scripture) greets you saying As-Salaamu 'alaykum, then say (to him): And upon you."
                        }
                    ]
                },
                {
                    "chapter_name": "For one you have insulted",
                    "chapter_no": 112,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبةً إلِيْكَ يَوْمَ الْقِيَامَةِ",
                            "duration": 10000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_112_230.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_230.mp3",
                            "verse_no": 230,
                            "verse_text": "O Allah, whomever of the believers I have abused, give him the reward of a sacrificial slaughter for it on the Day of Resurrection."
                        }
                    ]
                },
                {
                    "chapter_name": "The etiquette of praising a fellow Muslim",
                    "chapter_no": 113,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_113_231.jpeg",
                            "verse_no": 231,
                            "verse_text": "The Prophet (SAW) said: \"If any of you praises his companion then let him say: \"I deem so-and-so (person's name) to be... And Allah is his Assessor and I don't praise anyone, putting it forward, in front of Allah's commendation, however I assume him so and so ...if he knows that of him\"."
                        }
                    ]
                },
                {
                    "chapter_name": "For the one that have been praised",
                    "chapter_no": 114,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ لاَ تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَاغْفِرْلِي مَا لاَ يَعْلَمُونَ، وَاجْعَلْنِي خَيْرًا مِمَّا يَظُنُّونَ",
                            "duration": 21000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_114_232.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_232.mp3",
                            "verse_no": 232,
                            "verse_text": "O Allah, do not call me to account for what they say and forgive me for what they have no knowledge of and make me better than they imagine."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Nature",
            "category_no": 10,
            "chapter_count": 10,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "During a wind storm",
                    "chapter_no": 61,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهاَ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_61_166.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_166.mp3",
                            "verse_no": 166,
                            "verse_text": "O Allah, I ask You for the good of it and seek refuge in You against its evil."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا اُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا فِيهَا، وَشَرِّ مَا اُرْسِلَتْ بِهِ",
                            "duration": 25000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_61_167.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_167.mp3",
                            "verse_no": 167,
                            "verse_text": "O Allah, I ask You for the good of it, for the good of what it contains, and for the good of what is sent with it. I seek refuge in You from the evil of it, from the evil of what it contains, and from the evil that is sent with it."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon hearing thunder",
                    "chapter_no": 62,
                    "verses": [
                        {
                            "arabic_text": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ",
                            "duration": 14000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_62_168.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_168.mp3",
                            "verse_no": 168,
                            "verse_text": "Glory is to Him Whom thunder and angels glorify due to fear of Him."
                        }
                    ]
                },
                {
                    "chapter_name": "For rain",
                    "chapter_no": 63,
                    "verses": [
                        {
                            "arabic_text": "اللّهُمَّ اسْقِنَا غَيْثاً مُغِيثاً مَرِيئاً مَرِيعاً، نَافِعاً غَيْرَ ضَارٍّ، عَاجِلاً غَيْرَ آجِلٍ",
                            "duration": 20000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_63_169.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_169.mp3",
                            "verse_no": 169,
                            "verse_text": "O Allah, shower upon us abundant rain, beneficial not harmful, swiftly and not delayed."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_63_170.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_170.mp3",
                            "verse_no": 170,
                            "verse_text": "O Allah, send us rain. O Allah, send us rain. O Allah, send us rain."
                        },
                        {
                            "arabic_text": "اللّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِي بَلَدَكَ الْمَيِّتَ",
                            "duration": 17000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_63_171.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_171.mp3",
                            "verse_no": 171,
                            "verse_text": "O Allah, give water to Your slaves, and Your livestock, and spread Your mercy, and revive Your dead land."
                        }
                    ]
                },
                {
                    "chapter_name": "When it rains",
                    "chapter_no": 64,
                    "verses": [
                        {
                            "arabic_text": "اللّهُمَّ صَيِّباً نَافِعاً",
                            "duration": 6000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_64_172.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_172.mp3",
                            "verse_no": 172,
                            "verse_text": "O Allah, (bring) beneficial rain clouds."
                        }
                    ]
                },
                {
                    "chapter_name": "After rainfall",
                    "chapter_no": 65,
                    "verses": [
                        {
                            "arabic_text": "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ",
                            "duration": 7000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_65_173.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_173.mp3",
                            "verse_no": 173,
                            "verse_text": "It has rained by the bounty of Allah and His mercy"
                        }
                    ]
                },
                {
                    "chapter_name": "Asking for clear skies",
                    "chapter_no": 66,
                    "verses": [
                        {
                            "arabic_text": "اللّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الأَوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ",
                            "duration": 19000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_66_174.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_174.mp3",
                            "verse_no": 174,
                            "verse_text": "O Allah, let it pass us and not fall upon us, but upon the hills and mountains, and the center of the valleys, and upon the forested lands."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon sighting the crescent moon",
                    "chapter_no": 67,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالَأمْنِ وَالإِيمَانِ، وَالسَّلَامَةِ وَالِإسْلَامِ، وَالتَّوْفِيقِِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللَّهُ",
                            "duration": 33000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_67_175.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_175.mp3",
                            "verse_no": 175,
                            "verse_text": "Allah is the Most Great. O Allah, bring us the new moon with security and Faith, with peace and in Islam, and in harmony with what our Lord loves and what pleases Him. Our Lord and your Lord is Allah."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon seeing the early or premature fruit",
                    "chapter_no": 76,
                    "verses": [
                        {
                            "arabic_text": "اللّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِينَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا",
                            "duration": 20000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_76_187.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_187.mp3",
                            "verse_no": 187,
                            "verse_text": "O Allah, bless our fruit for us, bless our town for us, bless our Sa' for us and bless our Mudd for us.(Sa' and Mudd are both dry measures used for agricultural produce by the Arabs in the Prophet's time.)"
                        }
                    ]
                },
                {
                    "chapter_name": "Upon hearing a rooster crow or the braying of an ass",
                    "chapter_no": 110,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيـمِ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_110_228.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_228.mp3",
                            "verse_no": 228,
                            "verse_text": "When you hear the cock's crow, ask Allah for His favor upon you for surely it has seen an angel. When you hear the bray of a donkey, seek refuge in Allah from Satan, for surely it has seen a devil."
                        }
                    ]
                },
                {
                    "chapter_name": "Upon hearing the barking of dogs at night",
                    "chapter_no": 111,
                    "verses": [
                        {
                            "arabic_text": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيـمِ",
                            "duration": 9000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_111_229.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_229.mp3",
                            "verse_no": 229,
                            "verse_text": "When you hear a dog barking or a donkey braying in the night, then seek refuge in Allah from them, for surely they have seen what you see not."
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Sickness & Death",
            "category_no": 11,
            "chapter_count": 13,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "Placing children under Allah's protection",
                    "chapter_no": 48,
                    "verses": [
                        {
                            "arabic_text": "أُعِيذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ",
                            "duration": 22000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_48_146.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_146.mp3",
                            "verse_no": 146,
                            "verse_text": "I seek protection for you in the Perfect Words of Allah from every devil and every beast, and from every envious blameworthy eye."
                        }
                    ]
                },
                {
                    "chapter_name": "When visiting the sick",
                    "chapter_no": 49,
                    "verses": [
                        {
                            "arabic_text": "لاَ بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_49_147.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_147.mp3",
                            "verse_no": 147,
                            "verse_text": "Do not worry, it will be a purification (for you), Allah willing."
                        },
                        {
                            "arabic_text": "أَسْأَلُ اللَّهَ الْعَظِيمَ، رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ",
                            "duration": 14000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_49_148.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_148.mp3",
                            "verse_no": 148,
                            "verse_text": "I ask Almighty Allah, Lord of the Magnificent Throne, to make you well. (Seven times)"
                        }
                    ]
                },
                {
                    "chapter_name": "Excellence of visiting the sick",
                    "chapter_no": 50,
                    "verses": [
                        {
                            "arabic_text": "",
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_50_149.jpeg",
                            "verse_no": 149,
                            "verse_text": "When a man goes to visit his sick Muslim brother, he walks along a path\n of Paradise until he sits, and when he sits he is cloaked in mercy. If he comes in the morning, Seventy thousand angels pray for him until evening, and if he comes in the evening, Seventy thousand angels pray for him until morning."
                        }
                    ]
                },
                {
                    "chapter_name": "When the sick have renounced all hope of life",
                    "chapter_no": 51,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيقِ الأَعْلَى",
                            "duration": 10000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_51_150.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_150.mp3",
                            "verse_no": 150,
                            "verse_text": "O Allah, forgive me and have mercy upon me and join me with the highest companions (in Paradise)."
                        },
                        {
                            "arabic_text": "لَا إِلَهَ إِلَّا اللَّه إِنَّ لِلمَوْتِ لَسَكَرَاتٍ",
                            "duration": 16000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_51_151.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_151.mp3",
                            "verse_no": 151,
                            "verse_text": "There is none worthy of worship but Allah, surely death has agonies."
                        },
                        {
                            "arabic_text": "لَا إِلَهَ إلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ، لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيكَ لهُ، لَا إِلَهَ إِلاَّ اللَّهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، لَا إِلَهَ إِلاَّ اللَّهُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَاَّ بِاللَّهِ",
                            "duration": 46000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_51_152.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_152.mp3",
                            "verse_no": 152,
                            "verse_text": "There is none worthy of worship but Allah, Allah is the Most Great. None has the right to be worshiped but Allah alone. None has the right to be worshiped but Allah alone, Who has no partner. There is none worthy of worship but Allah, His is the dominion and His is the praise. There is none worthy of worship but Allah, there is no power and no might but by Allah."
                        }
                    ]
                },
                {
                    "chapter_name": "Instruction for the one nearing death",
                    "chapter_no": 52,
                    "verses": [
                        {
                            "arabic_text": "لَا إِلَهَ إِلاَّ اللَّهُ",
                            "duration": 10000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_52_153.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_153.mp3",
                            "verse_no": 153,
                            "verse_text": "There is none worthy of worship but Allah."
                        }
                    ]
                },
                {
                    "chapter_name": "When closing the eyes of the deceased",
                    "chapter_no": 54,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ اغْفِرْ لِفلَانٍ (باسمه) وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ، وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ، وَاغْفِرْ لَنَا وَلَهُ يَارَبَّ الْعَالَمِينَ، وَافْسَحْ لَهُ فِي قَبْرِهِ وَنَوِّرْ لَهُ فِيهِ",
                            "duration": 36000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_54_155.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_155.mp3",
                            "verse_no": 155,
                            "verse_text": "O Allah, forgive (say the person's name) and elevate his station among those who are guided. Send him along the path of those who came before, and forgive us and him, O Lord of the worlds. Enlarge for him his grave and shed light upon him in it."
                        }
                    ]
                },
                {
                    "chapter_name": "For the deceased at the funeral prayer",
                    "chapter_no": 55,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعَافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدْ، وَنَقِّهِ مِنَ الْخَطَايَا كَما نَقَّيْتَ الثَّوْبُ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ وَعَذَابِ النَّارِ",
                            "duration": 64000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_55_156.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_156.mp3",
                            "verse_no": 156,
                            "verse_text": "O Allah, forgive him and have mercy on him and give him strength and pardon him. Be generous to him and cause his entrance to be wide and wash him with water and snow and hail. Cleanse him of his transgressions as white cloth is cleansed of stains. Give him an abode better than his home, and a family better than his family and a wife better than his wife. Take him into Paradise and protect him from the punishment of the grave (and from the punishment of Hell-fire)."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ اغْفِرَّْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغَائِبِنَا، وَصَغِيرِنَا وَكَبِيرِنَا، وَذَكَرِنَا وَأُنْثَانَا. اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلَامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيمَانِ، اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ، وَلَا تُضِلَّنَا بَعْدَهُ",
                            "duration": 52000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_55_157.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_157.mp3",
                            "verse_no": 157,
                            "verse_text": "O Allah forgive our living and our dead, those who are with us and those who are absent, our young and our old, our menfolk and our womenfolk. O Allah, whomever you give life from among us give him life in Islam, and whomever you take way from us take him away in Faith. O Allah, do\n not forbid us their reward and do not send us astray after them."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ إِنَّ (باسمه) في ذِمَّتِكَ، وَحَبْلِ جِوَارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّار، وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ، فَاغْفِرْْ لَهُ وَارْحَمْهُ، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
                            "duration": 38000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_55_158.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_158.mp3",
                            "verse_no": 158,
                            "verse_text": "O Allah, surely (say the person's name) is under Your protection, and in the rope of Your security, so save him from the trial of the grave and from the punishment of the Fire. You fulfill promises and grant rights, so forgive him and have mercy on him. Surely You are Most Forgiving, Most Merciful."
                        },
                        {
                            "arabic_text": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ احْتَاجَ إِلَى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ فِي حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيئاً فَتَجَاوَزْ عَنْهُ",
                            "duration": 26000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_55_159.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_159.mp3",
                            "verse_no": 159,
                            "verse_text": "O Allah, Your male slave and the child of Your female slave is in need of Your mercy, and You are not in need of his torment. If he was pious then increase his rewards and if he was a transgressor then pardon him."
                        }
                    ]
                },
                {
                    "chapter_name": "For the deceased is a child, during the funeral prayer",
                    "chapter_no": 56,
                    "verses": [
                        {
                            "arabic_text": "(1)اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ الْقَبْرِ(2)اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوالِدَيه، وَشَفيعاً مُجاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازينَهُمَا، وَأَعْظِمْ بِهِ أُجُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المُؤْمِنِينَ، وَاجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيمِ، وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ، وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ ﻷَسْلاَفِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنَا بِالاءِيْمَانِ",
                            "duration": 78000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_56_160.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_160.mp3",
                            "verse_no": 160,
                            "verse_text": "O Allah, protect him from the torment of the grave.(1)O Allah, make him a precursor, a forerunner and a treasure for his parents and an answered intercessor. O Allah, make him weigh heavily in their scales (of good) and magnify their reward. Make him join the righteous of the believers. Place him in the care of Ibrahim. Save him by Your mercy from the torment of Hell. Give him a home better than his home and a family better than his family. O Allah, forgive those who have gone before us, our children lost (by death), and those who have preceded us in Faith.(2)"
                        },
                        {
                            "arabic_text": "اللَّهُمَّ اجْعَلْهُ لَنا فَرَطاً، وَسَلَفاً، وَأَجْراً",
                            "duration": 10000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_56_161.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_161.mp3",
                            "verse_no": 161,
                            "verse_text": "O Allah, make him for us a precursor, a forerunner and a cause of reward."
                        }
                    ]
                },
                {
                    "chapter_name": "Condolence",
                    "chapter_no": 57,
                    "verses": [
                        {
                            "arabic_text": "(1)إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى وَكُلُّ شَيْءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّى... فَلْتَصْبِرْ وَلْتَحْتَسِبْ(2)أَعْظَمَ اللَّهُ أَجْرَكَ، وَأَحْسَنَ عَزَاءَ ك وَغَفَرَ لِمَيِّتِكَ",
                            "duration": 23000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_57_162.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_162.mp3",
                            "verse_no": 162,
                            "verse_text": "Surely, Allah takes what is His, and what He gives is His, and to all things He has appointed a time. So have patience and be rewarded.(1)May Allah magnify your reward, and make perfect your bereavement, and forgive your departed.(2)"
                        }
                    ]
                },
                {
                    "chapter_name": "Placing the deceased in the grave",
                    "chapter_no": 58,
                    "verses": [
                        {
                            "arabic_text": "بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_58_163.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_163.mp3",
                            "verse_no": 163,
                            "verse_text": "With the Name of Allah and according to the Sunnah of the Messenger of Allah."
                        }
                    ]
                },
                {
                    "chapter_name": "After burying the deceased",
                    "chapter_no": 59,
                    "verses": [
                        {
                            "arabic_text": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
                            "duration": 11000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_59_164.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_164.mp3",
                            "verse_no": 164,
                            "verse_text": "O Allah, forgive him. O Allah, strengthen him.(The Prophet saw used to stop after burying the dead and say to the people: \"Ask Allah to forgive your brother and pray for him to be strengthened, for indeed he is now being questioned\".)"
                        }
                    ]
                },
                {
                    "chapter_name": "Visiting the graves",
                    "chapter_no": 60,
                    "verses": [
                        {
                            "arabic_text": "السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَّارِ، مِنْ الْمُؤْمِنِينَ وَالْمُسْلِمِيَن، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ، وَيَرْحَمُ اللَّهُ الْمُسْتَقْدِمِينَ مِنَّا وَالْمُسْتَأْخِرِينَ أَسْأَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ",
                            "duration": 46000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_60_165.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_165.mp3",
                            "verse_no": 165,
                            "verse_text": "Peace be upon you, people of this abode, from among the believers and those who are Muslims, and we, by the Will of Allah, shall be joining you. May Allah have mercy on the first of us and the last of us) I ask Allah to grant us and you strength."
                        }
                    ]
                },
                {
                    "chapter_name": "When feeling some pain in the body",
                    "chapter_no": 124,
                    "verses": [
                        {
                            "arabic_text": "(1)بِسْمِ اللَّهِ(2)أَعُوذُ باللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ",
                            "duration": 13000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_124_243.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_243.mp3",
                            "verse_no": 243,
                            "verse_text": "Put your hand on the place where you feel pain and say: \"With the Name of Allah\". (Three times)(1)Then say: \"I seek refuge in Allah and in His Power from the evil of what I find and of what I guard against\". (Seven times)(2)"
                        }
                    ]
                }
            ]
        },
        {
            "category_name": "Doa",
            "category_no": 12,
            "chapter_count": 1,
            "icon" : "assets/icon/praying.png",
            "chapters": [
                {
                    "chapter_name": "Placing children under Allah's protection",
                    "chapter_no": 48,
                    "verses": [
                        {
                            "arabic_text": "أُعِيذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ",
                            "duration": 22000,
                            "share_url": "https://cdn.mymuslimdaily.com/res/dua/share_48_146.jpeg",
                            "verse_audio": "https://cdn.mymuslimdaily.com/res/dua/dua_146.mp3",
                            "verse_no": 146,
                            "verse_text": "I seek protection for you in the Perfect Words of Allah from every devil and every beast, and from every envious blameworthy eye."
                        }
                    ]
                }

            ]
        }
    ]
}